{
  "app_name": "Moviebase: TV & Movie Tracker",
  "app_id": "com.moviebase",
  "reviews": {
    "us": {
      "1": [
        {
          "at": "2025-05-31T05:09:59",
          "review": "The app has added an excessive number of ads, so much so that just switching between each episode or tab, a full-screen ad interrupts the experience. This is a deal breaker for me, and I'll switch to another app as soon as possible. This was one of the best apps I've used, goodbye dear old friend"
        },
        {
          "at": "2025-05-07T04:10:53",
          "review": "it's bad and it's not for free and my son hate it and me too pls make this app for free and make the movie for free"
        },
        {
          "at": "2025-04-28T19:38:01",
          "review": "this app limits the amount of movies you can mark as watched for free users after the latest update, that makes it completely unusable, i can't mark movies as watched anymore. I have seen greedy people before but never like this. The most basic function can't be behind the paywall."
        },
        {
          "at": "2025-04-23T12:35:05",
          "review": "The app was declining in quality but it's absolutely unusable now, my trakt progress cannot be synced at all and the app just keeps pushing for premium. My entire collection of history just stopped showing up on the app. Luckily my progress is still available on the trakt account and they have a decent app which should do for now. Thoroughly disappointed, can't believe I spent 18 dollars for a year and as soon as the subscription ended the devs just treat it's non premium members like trash."
        },
        {
          "at": "2025-04-14T09:15:30",
          "review": "Have you seriously put the ability to mark something as watched behind a paywall after the latest update? I've had no issue with all the ads that pop up but you're taking the piss with this now. It's just greed at this point! I'll be uninstalling and using a different app from now on to connect my Trakt too. Absolutely shameful!"
        },
        {
          "at": "2025-04-11T16:50:27",
          "review": "This isn't for me.... It shows you content but no option to watch... Instead it directs you to netflix or prime.. I'm unable to use those because I don't have accounts with them... So Thanks but no thanks. This site has no database."
        },
        {
          "at": "2025-04-08T02:35:57",
          "review": "there were ads in every apps . but this is aaaah . on every click like some cheap website. hhha uninstalled"
        },
        {
          "at": "2025-03-28T10:13:04",
          "review": "it will pass you to another site to watch movies or series, this app is TRASH! don't waste your time in this bullcrap app. 😡"
        },
        {
          "at": "2025-03-23T03:07:34",
          "review": "I am not paying for anything and I shouldn't have to because there's plenty of apps that will give me free movies"
        },
        {
          "at": "2025-02-15T20:51:11",
          "review": "Not Syncing with Trakt after 5.2.5 update please dont mess with this app it used to be a special good app on the store last years you will lose its popularity and hard work in the next months many apps will be introducing and having many features with ai which make this app dissapper"
        },
        {
          "at": "2025-02-12T20:28:47",
          "review": "Excessive ads make it difficult to use the app properly. The frequent and mandatory ads ruin the user experience."
        },
        {
          "at": "2025-01-05T04:09:17",
          "review": "more than i trusive ads, i mean have ads but dont make it get in the way, prompts payment on first open"
        },
        {
          "at": "2025-01-02T06:07:33",
          "review": "Was a subscriber but after the removal of tbdb login I removed the app and cancelled the subscription. Very bad behavior to change core functionality for paying customers. Comment from Moviebase team is not accurate, tmdb login is removed and this is not a bug."
        },
        {
          "at": "2025-01-01T06:40:25",
          "review": "Used to be great. Now it's just constant adverts. With the latest update, all my history and watch lists have been deleted, with the aim of making me subscribe. These tactics are a real turn off."
        },
        {
          "at": "2024-12-31T23:42:51",
          "review": "Totally SUCKS!!! Complete AD supported!!! Never had ads before!!! Everything AD you AD touch AD there's AD an AD ad!!!"
        },
        {
          "at": "2024-12-28T09:36:34",
          "review": "Ads are so frequent and repetitive than before. I don't really mind ads in general especially when they're designed in a way that's bearable and you don't feel their presence that strongly. This app used to be so much better, but after some unnecessary updates (or probably just the developers' wish for it to be that way) I now have to look at ads -now mostly videos that you cannot even skip in a second or two but 10 or more- more than I see other content in the app. Fix this please."
        },
        {
          "at": "2024-12-28T08:21:02",
          "review": "Used to be my favorite app to track movies but it fell off hard. You have to watch a 15 second ad every time you click on something before it even loads the page. I don't mind apps with ads because I know developers need to cover costs but this is very excessive and very annoying to use. I will be moving to a different movie tracker"
        },
        {
          "at": "2024-12-20T23:24:43",
          "review": "Wow that was uncalled for. Now ill have to find another app and re-check hundreds of movies. As if the ads arent enough. Was top of the top untill you implemented a limit. Too bad"
        },
        {
          "at": "2024-12-19T18:26:33",
          "review": "My TV shows have glitched. For example, the bachelorette, season 20 says there are 10 episodes,but only nine of them are showing up ,so you can't check off your progress. So, in turn, it glitches,and you are unable to have it moved over to your upcoming side because it wants to stay on the current tab as if you've not watched those episodes. You can't check that off completely, so it's just stuck. No response or fix on the issue from them. This is still an ongoing issue. Please fix it."
        },
        {
          "at": "2024-12-08T23:36:20",
          "review": "I made an account and it nuked 2 hours of my progress just listing things. It also shoves ads in your face annoyingly, and the summaries for shows and movies never loads. I'm uninstalling immediately."
        },
        {
          "at": "2024-11-25T23:07:12",
          "review": "I'm soo pissed off to find out that this app doesn't provide actually movies..just images here and there not even movie tape"
        },
        {
          "at": "2024-11-13T21:32:12",
          "review": "You have to like buy a movie this app is the worst there is also some subscription man this app sucks"
        },
        {
          "at": "2024-10-20T15:03:42",
          "review": "I assume once I download this app I was going to go on the movie or show or whatever to watch and be like okay I'm going to watch it no you think you going to watch something that's a lie . So this app is fake & its spam. Y'all pay people to say false statements or they high or not smart. I'm sorry to say. So I'm deleting this fake app"
        },
        {
          "at": "2024-09-21T20:26:18",
          "review": "Would be nice to know you charge R340+ a year to \"keep track\" of my movies and series BEFORE I downloaded the app. I'll rely on notifications, thanks. App deleted."
        },
        {
          "at": "2024-09-16T10:48:47",
          "review": "The videos must be for free not to be paid for Money is not life ,make them free and it must not have movies for adults only for children e.g lound house,nicky.dicky.ricky.and dorn only like those ones thank you for reading please understand or can u give me a moive app without adults just give suggestions 🙏 thank you 😊"
        },
        {
          "at": "2024-09-13T02:11:31",
          "review": "This amount of trackers is a joke. Making things even worse is the process to disable them. Just disgusting. 30 € Premium Subscription ... Sure :-D"
        },
        {
          "at": "2024-08-22T05:19:22",
          "review": "lit waits until after u subscribe to tell u it's not a streaming service. it keeps you up to date on new movies but you can't watch them.. HAHAHAHA"
        },
        {
          "at": "2024-07-29T00:03:47",
          "review": "This used to be a 5 star app though now it has become practically unusable due to a constant annoying ad that you cannot get out of. This pops up every second time I click on a movie or show making this app a piece of garbage now. Well done greedy developer for destroying what was once a fantastic app. Deleted from my device now!"
        },
        {
          "at": "2024-07-06T02:06:55",
          "review": "This used to be a 4 star rating. Now i get an unskipable ad every single time I click on a movie, rendering the app virtually unusable. What a joke."
        },
        {
          "at": "2024-04-23T20:47:00",
          "review": "I bought a lifetime premium around 2020 or 2021 now they have removed that and now app is also not responding ...thats not a fair thing to do .....that's very wrong."
        },
        {
          "at": "2024-04-21T02:20:40",
          "review": "the best app ever...I can watch any movies I want so nice tho mmm🥰I love it ...you should try it tho❤️"
        },
        {
          "at": "2024-03-25T11:12:58",
          "review": "I bought the premium in 2020 and now they have removed me from premium. The support also isn't responding since last 3-4 days.. I dropped my email. Developers if you are honest do reply and let me know why my premium isn't working."
        },
        {
          "at": "2024-03-15T08:05:05",
          "review": "This is one big fail it shouldn't even be here I didn't even get to watch a movie This app is useless Anyone reading this don't waste your time and data downloading this"
        },
        {
          "at": "2024-03-05T22:53:20",
          "review": "Update: Developer didn't fix the problem, and wouldn't give me a refund. Cancelled subscription. PLEASE STOP ADULT CONTENT FROM POPPING UP WHEN SEARCHING FOR MOVIES."
        },
        {
          "at": "2024-03-05T04:45:07",
          "review": "Changing my review from 5 to 1 star. Suddenly stopped working for me. Tried everything to make it work but nothing happened. It was my favourite app for trakt. Disappointed."
        },
        {
          "at": "2024-02-19T20:03:21",
          "review": "Lots of ads in the app. Better to try other alternatives. Most of the reviews here are by bots with standard wordings and totally unaware of the app.. lol. I was hoping they will reduce the ads after my last review 6 months ago. Better to uninstall and use Cinetrak or trakt apps."
        },
        {
          "at": "2024-02-18T20:08:39",
          "review": "The app seems not functioning from past 3 days...it says \"we dont receive valid data\" please retry. Dev. Please look out"
        },
        {
          "at": "2024-02-01T02:23:01",
          "review": "It was a very neat app before they deleted all the data I had collected with the new update! All my History and Watchlists are gone! And purchasing Premium has not helped!!!"
        },
        {
          "at": "2024-01-22T20:21:12",
          "review": "I don't know why but am in able to watch movie. Without me subscribing I can't watch movie in the app even with data?"
        },
        {
          "at": "2024-01-14T06:42:13",
          "review": "I really don't understand what's going on I wanna watch something and I can't I tap on the movie and I can't see anything"
        },
        {
          "at": "2024-01-08T11:04:30",
          "review": "Updated to the latest version, which then crashes repeatedly, and asks me to buy premium every single time I open it."
        },
        {
          "at": "2023-12-22T08:43:35",
          "review": "Installed. It immediately tried to sell me stuff. Then it didn't have the very first movie I was looking for. Google did. Uninstalled."
        },
        {
          "at": "2023-12-12T03:27:01",
          "review": "it's my first time using this hopefully there are lots of Martial arts Movies that I haven't seen yet"
        },
        {
          "at": "2023-11-22T02:48:22",
          "review": "What's the point of this app? You can't watch movies; you pick your favorite movies and that's it! Very confusing and a complete waste of an app."
        },
        {
          "at": "2023-10-30T01:30:19",
          "review": "Your app keeps closing out after I use the search feature, it seems like your search feature has been disabled."
        },
        {
          "at": "2023-10-01T02:04:53",
          "review": "first open it wanted me to subscribe. why ask to pay for something you have never used? In response to \"if you are unhappy with any of the features, you can contact us at\". I opened the app and was asked to pay. I don't know the features or any clue what I would be paying for. No thank you."
        },
        {
          "at": "2023-08-09T00:14:34",
          "review": "It used to be a great app until last update in July. After July's update, it shows an ad on every click which is extremely annoying. Going to uninstall the app until they fix it. One or two ads should be enough for each session, but an ad for every click is something nobody wants."
        },
        {
          "at": "2023-08-02T15:28:47",
          "review": "I'm finished with your ads &/or subscription prices. You losers that keep being that annoying are Uninstalled & given horrible reviews for wasting people's time without paying them. You're all greedy trolls I'm sick of seeing everywhere. #GoodRiddance"
        },
        {
          "at": "2023-07-23T06:09:34",
          "review": "No. Before this app would work for the first time it wanted access to my google play credit card account, without me ever having used it."
        },
        {
          "at": "2023-06-17T10:19:20",
          "review": "It shows ads only in foreign languages so you can't close them. Every time you click a show or movie"
        },
        {
          "at": "2023-06-16T22:32:16",
          "review": "Asked for my phone number to send pin via sms. I received sms but option for input pin disappeared foor good living me option only to ask again for pin. Every sms is about 3eur so I gave up"
        },
        {
          "at": "2023-05-19T02:06:25",
          "review": "Please don't there to download this app it is rubbish you can't even download videos with it, it only shows pictures only,it Such a Rubbish app"
        },
        {
          "at": "2023-05-18T09:47:32",
          "review": "Now that the official Trakt app is here, makes no sense to pay for an \"annual subscription\" for a third party app. I'd have bought the app if only they sold a lifetime sub instead of yearly, As good as the app maybe, it's just a cash grab."
        },
        {
          "at": "2023-04-03T22:12:01",
          "review": "Won't allow you to watch anything without you Subscribing first !!!!.... Just like ½ of the other movie apps. All they want from you is your...................... \"MONEY\"...\"MONEY\"...\"MONEY\" \"MONEY\"...\"MONEY\"...\"MONEYYYYYYYYYYYY\" !!! p.s. - How did they create those \"FAKE\" ratings ??? Google Play should investigate \"BEFORE\" allowing it in Playstore."
        },
        {
          "at": "2023-03-26T10:37:54",
          "review": "Long time user here, the ads have gotten out of control. Unstoppable 15 second ad everytime you click on a different movie? Useless."
        },
        {
          "at": "2023-03-19T12:21:28",
          "review": "This most scam you should never watch this piece of garbage i hate this packing up i should ever ever ever ever"
        },
        {
          "at": "2023-02-18T00:25:43",
          "review": "They asked immediately money through credit card details as so called \"free\" trial. Why not given areal probation time , maximum 10 days or 30 days, absolutely free, no money, no credit card details, and after this perriod, you can pay, if you are pleased by the quality and the diversity of the films/ movies?!!"
        },
        {
          "at": "2023-02-06T05:13:56",
          "review": "Suddenly I cannot access moviebase anymore as they tell me i need to update. Yet i have the most up-to-date version. That's a one star performance for me."
        },
        {
          "at": "2023-01-25T03:37:36",
          "review": "Not showing rankings from IMDB, Roten Tomatoes, etc. Too many screens to get where you need to go. Ads everywhere. Not an enjoyable experience."
        },
        {
          "at": "2023-01-14T04:36:11",
          "review": "Uninstalled - don't like apps that try to get you to click to open unknown material. Don't care what Livebeam is."
        },
        {
          "at": "2022-11-27T22:11:20",
          "review": "this app takes a long time to open and asks for to much data sharing. i dont mind an ad but not all my personal information to be put on third party sites ."
        },
        {
          "at": "2022-11-17T07:34:23",
          "review": "Every other update breaks one or more parts of the app, the most recent has made it completely unusable as it just shows a pop-up saying to update to the latest version, which it's on, and this pop-up prevents you from using the app at all, can't reinstall because the syncing issues have never been fixed so losing months of logging is the only guarantee from that"
        },
        {
          "at": "2022-10-28T19:00:08",
          "review": "When I started this app for the first time, it showed me immediately a pop-up asking for a rating. I haven't even been possible to test out this app. I find that a very intrusive and pushy!! That is for me already a reason to give one star!"
        },
        {
          "at": "2022-10-19T21:15:48",
          "review": "19th Oct'22 - Originally was an excellent experience 5 Stars! THEN updated to latest version and the intrusive ads have put me completely off from using what otherwise is a fantastic app. Feedback: Totally understand that you need to generate income from Ads and customers can opt for the Ad free paid version. What will help improve the free Ad Version is to follow other popular and successful apps which place a countdown in the top right hand corner with a button to skip ad once the timer ends."
        },
        {
          "at": "2022-08-30T06:29:55",
          "review": "UPDATE: App is not syncing/ loading since the last update!!! This app is amazing, it offers a variety of home customization and keeps track of your watch history."
        },
        {
          "at": "2022-08-16T21:02:55",
          "review": "It is a nice app really because I see both old and new movies and it's not all that expensive It gives a role hobby to your life It brings back the daily Entertainment"
        },
        {
          "at": "2022-07-19T18:11:28",
          "review": "Synchronisation error: Application is not storing the data of watched movies and webseries. When application gone slow and laggy I synchronised and reinstalled app. Now I've lost all data from past 2 months"
        }
      ],
      "2": [
        {
          "at": "2025-05-12T08:09:57",
          "review": "Love the app but when logging in after a fresh download, I can't get past the review screen. the button at the the of the onboarding \"let's explore\" is greyed out. I can't get into the app...."
        },
        {
          "at": "2025-03-11T19:21:10",
          "review": "Best Movie n TV data app.. Really appreciate the new features specially addition of popular review aggregaters...Edit(11/03/25) now the app is not working properly.. many bugs like home page not loading and a search bar not responding etc."
        },
        {
          "at": "2024-12-27T00:20:44",
          "review": "I'll stick with Letterboxed, Serialized & Just Watch. Pop-up ads and what should be basic features being locked are a strong no for me."
        },
        {
          "at": "2024-12-22T08:31:02",
          "review": "It is not clear if this app is for me alone to see I have sounds all aeou d commenting even ruddy views on my fingers moving make Wonly the frame works never ends"
        },
        {
          "at": "2024-10-18T07:41:35",
          "review": "Not at all easy to use, clunky. And then it lost all of my progress. Just when you think you know how to add a show, you don't get the updates for it. I give up."
        },
        {
          "at": "2024-05-04T13:09:50",
          "review": "UNINSTALL App works OK but the update since the last time I used it now has long ads you can't click thru or get out of. Had to watch a ridic long demo ad of a game I will never play then it auto opens in the playstore. Had to hit back 3x to get out of it. This is a stupid amount of effort just to mark a lame movie as watched just to give them my free user data which they'll probably then sell."
        },
        {
          "at": "2024-04-07T20:12:26",
          "review": "I recently installed this app and when I try to synchronise with Trakt, it takes forever. Please fix this issue."
        },
        {
          "at": "2024-03-27T18:40:28",
          "review": "What's happening with this app!! I would be happy to pay the premium but it keeps freezing on me. Doesn't change pages, I have to keep closing it refreshing it does it again. Shame used to be the best movie app ever!! Ruined it."
        },
        {
          "at": "2024-02-04T03:52:35",
          "review": "It used to be a great app, but there are way too many adverts now. Jumping between episodes in a season and I'm getting adverts every 3-4 screens. It's just ridiculous. I think I'll just go back to using Trakt."
        },
        {
          "at": "2023-11-21T13:51:04",
          "review": "You can rate movies/shows and track each episode and season watched, including specials. If you haven't watched yet, it'll say where you can watch. Just hit the app You want to watch on, and it'll take you to that app to watch. Tv time does all this too plus, no ads, and you don't have to pay for a premium membership to be able to comment on what you watch, and you can follow others who watch the same content, and tv time will show you how many total hours you've watched both movie and tv."
        },
        {
          "at": "2023-10-17T15:38:23",
          "review": "UI is a chaotic, disorganized carousel bonanza. If you want an app that's as annoying to scroll as Netflix, here ya go. Not serious competition for Letterboxd"
        },
        {
          "at": "2023-06-16T06:44:57",
          "review": "Needs home button always displayed so I don't have to close out the app or hit back 10x to go back to the home screen. Needs a way to remove a show from my lists if I don't want to watch it anymore or get updates. Otherwise, app is weak."
        },
        {
          "at": "2023-04-25T17:22:16",
          "review": "I like the idea of it, and my first use was fine. Ever since, however, any page I move to gets stuck on the loading screen. I could deal with the long, repetitive ads if I could actually use the app."
        },
        {
          "at": "2023-03-19T03:07:28",
          "review": "i can't synchronize anything with my trakt account (it looks like its can't connect to the service),pls fix the issue,I'll change my review after solving the problem using app on Android 7"
        },
        {
          "at": "2022-12-31T05:33:13",
          "review": "Can you integrate more sorting options for movies? Specially with category type. That's much needed feature. Edit: Last update created a memory leak so app is not usable after 3 mins and phone starts lagging"
        },
        {
          "at": "2022-08-29T06:10:47",
          "review": "No movies available for you to watch: They want you to download other apps for movies, they set up all this stuff and don't have no movies for you to watch or observe!"
        },
        {
          "at": "2022-07-22T22:10:33",
          "review": "The app is nice, but I found some bugs right after installing it. This was a bit disappointing, considering that the app really wants to convince me to buy the premium. For a premium app, I would expect better. Sadly I have to lower my score to 2 stars, as the synchronization from Trakt to Moviebase is not reliable..."
        }
      ],
      "3": [
        {
          "at": "2025-02-01T15:14:57",
          "review": "It was 5 but now 3 stars!!! Excellent app, superb, I love it!!! BUT lately you are showing so much fake scamming ads guys??? Where's the quality and security control??? It really is a shame ... Very disappointed in the last few months about the ads shown!!! Just to be clear: I am not complaining about the ads in general for the free version BUT for the ads leading to SCAM sites"
        },
        {
          "at": "2025-01-14T08:28:41",
          "review": "I wish I could give it 5 stars. But I needed to uninstall and reinstall and now it's showing that I've already purchased the Moviebase Unlimited premium on 10/24/24 through Google Play for $35.08"
        },
        {
          "at": "2024-12-31T11:00:31",
          "review": "I really like using this app but it's absurd to constantly be advertising the developer's other apps in the top half of the screen (in a paid subscriber). Please respect your customers."
        },
        {
          "at": "2024-11-10T02:08:57",
          "review": "Great app, but keep an eye out on the privacy permissions. 128 vendors want access to your data, with a dozen of toggles to disable."
        },
        {
          "at": "2024-10-10T16:33:18",
          "review": "Amazing app however it has someone issues specially when i try to to sign in to my account from another device. I removes some of the movies TV shows delete some of of the watched content remove some from my personal lists etc it is like it did not get all the data that is stored in my account into the new device"
        },
        {
          "at": "2024-07-09T15:30:44",
          "review": "Please I mistakenly subscribe in this app and I really need a refund please the money is not mine please help me..."
        },
        {
          "at": "2024-05-12T21:32:05",
          "review": "App good. But work on past bugs. Widget and app still does not refresh new upcoming content unless you manually sync by opening app and pull down to sync"
        },
        {
          "at": "2024-04-20T17:22:00",
          "review": "Decent app, but could be a lot better. Most of the home screen categories are terribly curated. I don't care what's going to be on DVD in 2031. Also, I just want to be able put my own notes on the movies I watch without having to write a review."
        },
        {
          "at": "2024-04-02T17:19:46",
          "review": "This app is very helpful and useful when it comes to movies , all kind of movies. I have used it for about 1 year"
        },
        {
          "at": "2024-02-25T03:18:43",
          "review": "It's such a good movie log app but there has been a bug for a while where the lists I have flash and then the screen goes black. I can still add to the lists but I can hardly see them and it's super annoying."
        },
        {
          "at": "2024-02-21T22:30:32",
          "review": "I used to love moviebase for its userinterface design but after this new update the app homescreen and it keeps on loading the icons. I have even tried to uninstall and reinstall but after installing and connecting to trackt it keeps on syncing and it doesn't end. At this point i cant use app in any manner. Fix this asap"
        },
        {
          "at": "2023-11-25T16:59:51",
          "review": "You have a good app here. Even subbed. Could use improvement though. 1. LET US..ADD A PICTURE & CHANGE EMAIL AND OUR USERNAME ON OUR PROFILE WITHOUT HAVING TO SIGN UP AGAIN WITH A NEW ACCOUNT 2. Let us..be able to RECOVER OUR ACCOUNT WITHOUT EMAIL in case we forget our sign up email 3. Let us..ADD THE MOVIE PRODUCTION COMPANIES that you have IN SEARCH to our PERSONAL LISTS and, 4. ADD MGM, A24 & BLUMHOUSE TO PRODUCTION COMPANIES. Once THESE things are addressed, FIVE stars all the way!"
        },
        {
          "at": "2023-05-19T07:08:50",
          "review": "Don't know how many stars to give this app because in one hand I really like this app on my Android and the features are super useful for me but in other hand I miss this app on my iOS devices like my iPad and Mac! I don't wanna use 2 or 3 different apps for the same purpose so It would be really appreciated if the developers bring iOS support or atleast a webapp would work too!"
        },
        {
          "at": "2023-03-05T16:11:36",
          "review": "Great app . But some movies relese year is wrong and we cant search by name with year. Please correct the release years of some movies"
        },
        {
          "at": "2023-01-30T10:00:53",
          "review": "One of the nicer Trakt apps available, but it needs some changes to really focus on the management of Trakt data. {-1-} There needs to be more immediate access to Collection, Personal Lists, and Watchlist. I'd suggest doing this by allowing for the removal / replacement of bottom-row tabs like Home, Search, and TV Shows. {-2-} Please add a prompt before removing something from Collection (keep the Undo prompt too, but please prompt before actually removing in the 1st place.)"
        },
        {
          "at": "2022-12-30T20:13:14",
          "review": "Everything works perfectly but in synchronization tab nothing works! I can't sync data with my trakt!! plsss tell me how to fix this issue ♡"
        },
        {
          "at": "2022-09-05T05:34:15",
          "review": "This app is getting very irritating. It keeps taking shows off of my watchlist without my knowledge. Why does it keep doing this!? It's very annoying, and this doesn't show movies and tv show recom from Amazon Prime video and Crave."
        },
        {
          "at": "2022-09-02T01:33:29",
          "review": "Good app but unstable due to ADs, works great when I block ADs using custom DNS but as soon as I disable custom DNS app starts freezing quite often, expecially when opening the app."
        },
        {
          "at": "2022-07-29T08:30:54",
          "review": "It's the best-looking Trakt companion app I've used on Android so far, but it would be so much better if the preferred rating source was shown in list view. I'd like to use this app to skim for movies I'll like, but I have to click on each movie to see the IMDB rating. The Trakt ratings simply don't have a large enough sample of voters."
        }
      ],
      "4": [
        {
          "at": "2024-11-10T12:14:25",
          "review": "App is working now. But there's some problem with syncing with trakt, if I update from trakt directly, it takes time for app to show up in it even though No delay is set in settings. Sometimes it doesn't even show it at all even later."
        },
        {
          "at": "2024-07-21T03:49:52",
          "review": "I've tried every movie tracking app, it could be the best but it needs two crucial options: 1. Don't show watched movies in recommendations 2. Giving more interesting insights"
        },
        {
          "at": "2024-05-20T03:11:27",
          "review": "I will see you and I will tell you because it is good or not good I don't know that's why and you can give me parmision I will see and I will tell anything is ther problem I will report tomorrow is partnership with photo this photo update the status of my number is not reachable by hi nahi hai taiyari shuru me athato matladathaava in Telugu h in logo ko i in Telugu i of the dragon Ball dragon movie in Telugu Telugu dubbed I want to you pranathi in Telugu movie in Telugu Telugu dubbed movies"
        },
        {
          "at": "2024-04-27T09:56:41",
          "review": "One of the best (if not the best) app for anything Movies/TV related. Only downside is that for the backup function you need to buy the premium version. But I think I will pay for this app. (Take my money)."
        },
        {
          "at": "2024-04-13T18:18:41",
          "review": "I've been using the app for a few days, I like it, useful and easy to understand, but please add more features like more content details especially a Parental Guid, and settings like importing personal library and watchlist from other platforms like IMDb. Keep working 💪 It will be great if you add a feature to export some movie or show as a well-organised screenshot or card (with the important infos) to save it or send it to someone 🙏"
        },
        {
          "at": "2024-03-19T23:10:39",
          "review": "great app and also reminder for all your favorite serie but can add something like up coming movie but guyzzz great jobs with the app"
        },
        {
          "at": "2024-01-06T08:41:28",
          "review": "Type @ in the comments below and select highlight to see who normally check your profile.If it turns blue then you got page watchers"
        },
        {
          "at": "2023-11-24T21:00:09",
          "review": "Good app, but it's recent versions (incl. 4.6.5) have an annoying issue. It is capable to create backups but is not able to restore it"
        },
        {
          "at": "2023-11-01T23:45:54",
          "review": "Being a user of Anilist (anime tracker), if this app could replicate its features, it would easily be a 5/5. Many things missing but its heading in a good direction. One of my favourite features is franchise grouping and seeing the connectied movies"
        },
        {
          "at": "2023-10-07T23:49:15",
          "review": "I really enjoy this application use it almost everyday. The only change I really would like to see if a setting to hide anime/cartoons as I find it's congested with it, unfortunately."
        },
        {
          "at": "2023-09-10T13:03:26",
          "review": "recently I reinstalled the app, to give it another chance... and I was surprised for good... after 20 months, this app has improved a lot... it has more functions that other apps - customizing homepage with various categories, easier tracking, more information about the titles, including the cast, and as always phenomelan UI... two things I would change - dont ask for the date when adding older shows, and add more regions... hopefully I will give 5 stars next time..."
        },
        {
          "at": "2023-09-01T03:04:05",
          "review": "New update looks better with the orange search removed. The TV section is sleaker, the minimalist selector for progress and upcoming looks good. The movie section however, I'm not a fan of the giant pill shaped selector at the top, much prefer the tv show design. Movie sorting works for history and watchlist, thanks for fixing that! Just noticed that there isn't a to watch section in TV, definitely needs to be added. Thanks for the updates and for making the best media tracker!"
        },
        {
          "at": "2023-07-25T15:03:25",
          "review": "I would like to be able to disable the season and episode section in watchlist and also be able to set IMDb rating in the list view as well , thank you"
        },
        {
          "at": "2023-07-21T20:37:36",
          "review": "Love it. Can we have more filters in the search tab? Also a \"hide watched\" option in search would be great"
        },
        {
          "at": "2023-03-03T01:12:27",
          "review": "Looks good so far. Do not understand why this app along with a few others don't have a section for Oscar or Golden Globe nominated movies."
        },
        {
          "at": "2023-01-15T23:02:21",
          "review": "It has been 2 years now using it and I initially voted 5/5 but recently I cant give it more than 4/5! It has very good features, continuesly updated one of them, but one feature that many other similar have and this doesn't is the show/use the Rotten tomatoes or/and Metacritic score/reviews. And that is in my opinion, a shortcoming when compared to other apps (especially Watcht, which I used before passing to Android). I hope in the future upgrades this will be fixed."
        },
        {
          "at": "2023-01-06T10:15:27",
          "review": "ALERT: I never give 5 stars in rating. This app is just the best. Their UI is state of the art. Their features are top of the class. And I am not even a premium user. P.S. Check out the Recommendation section in shows. The recommendation section in every show is.. is.. THE BEST. For every movie, every series, the recommendation I got, either matched what I previously watched or am watching now. And they aren't just similar to it. There's a similar section also, which houses shows similar to it."
        },
        {
          "at": "2022-12-31T16:46:04",
          "review": "I have been a premium user of this for more than a year. The app is great but some important features are missing.⁉️ 1️⃣. There should be an option to keep track of upcoming movies on my watchlist. 2️⃣. In the TV Shows progress section there should be an option to put shows on hold. (Currently, there is only an option to hide shows)"
        },
        {
          "at": "2022-12-05T23:48:28",
          "review": "Really nice UI layout, poster are clear and in good detail, options and settings are abudant, really pleased with application, would love to see the ability to customise some of the menus, such as being able to remove/hide things like seasons and episodes from the watchlist category etc...and also being able to view Trakt liked lists."
        },
        {
          "at": "2022-11-19T23:58:29",
          "review": "My goto Trakt.tv client on android! Absolutely perfect in every which way. The only thing I'd suggest the Developer is the suggestions while searching for an obscure movie -especially anything Asian related content is a hit/miss even though the entries are on TMDb. If that gets fixed, this is a near perfect app."
        },
        {
          "at": "2022-11-10T02:46:28",
          "review": "Beautiful app 👌Just facing one issue: I am getting notifications for new episodes only after opening the app. I am using the Premium version. I thought the app will notify me even without opening it?"
        },
        {
          "at": "2022-10-16T07:33:27",
          "review": "Nice, but I wish all my TV shows will appear on the upcoming, because if for example I havent watch a single episode of the show it wont add up to the upcoming. But once I watched an episode of the show it will show up on the upcoming."
        },
        {
          "at": "2022-08-01T00:34:24",
          "review": "Please add HBO Max as a provider and allow profile user rating sort at least in history for 5 stars."
        },
        {
          "at": "2022-07-15T00:05:40",
          "review": "Hi! Love the app. Simple and functional. However when trying to synchronise with Trakt I can only sync my watchlists and not my history. Could you please fix this?"
        }
      ],
      "5": [
        {
          "at": "2025-06-24T05:44:04",
          "review": "Thank You For Sharing Your Experience And Always Supporting Us Daily Watching Great Movies Every Day. Thank You For Showing Your Experience. Keep It Up 💯."
        },
        {
          "at": "2025-06-14T14:28:54",
          "review": "thanks for introducing this app to me. though dis is d first time of using it, know that you will not be boring when using it. thanks Welcome to Gboard clipboard, any text you copy will be saved here."
        },
        {
          "at": "2025-05-20T17:56:37",
          "review": "love the app.... krueger you are awesome. thanks for reverting the watchlist limit, if you are out of money do one thing add buy me a coffee button I would be the first to be helper for the server cost but don't limit the list count"
        },
        {
          "at": "2025-04-29T02:10:54",
          "review": "I would like to give 5 stars to this amazing and interesting app, I truly recommended this app to everyone!"
        },
        {
          "at": "2025-04-21T11:08:44",
          "review": "I've used Moviebase for years and I love it. Any issues that are bought up to the developer are worked on straight away, and you always feel listened to when raising concerns. I use premium, but the free version is fully usable and the premium isn't necessary if you aren't wanting to pay. I will continue using Moviebase as unlike other tracking apps, they don't put limits on lists or watchlists."
        },
        {
          "at": "2025-03-27T19:21:59",
          "review": "thanks for your wonderful app. have a question. how can I separate my account in moviebase from traktv? is there any way? because I usually login with my traktv account"
        },
        {
          "at": "2025-03-14T18:31:49",
          "review": "wow, it's such a Nice one... Great apps you can trust Anytime Anywhere, with reliable trust for Downloads, stress less with fast network wave, I advise you give this App a trial and share your testimony just like me... 👍👍"
        },
        {
          "at": "2025-03-12T03:59:05",
          "review": "Great app! I’d appreciate a feature that allows movies within a list to be arranged in a custom order, making it possible to create personalized ranking lists. Additionally, the ability to share these lists—potentially including my own ratings—with friends would be fantastic!"
        },
        {
          "at": "2025-03-11T18:06:49",
          "review": "I love this app, but I have decided to switch from Trakt to SIMKL after they limited the watchlist for normal users. It would be great if I could continue using this app with SIMKL."
        },
        {
          "at": "2025-02-20T12:10:43",
          "review": "Great UI design, resonable pricing. I'd like to move away from trakt, anyway to export data to moviebase or tmdb?"
        },
        {
          "at": "2025-02-10T13:49:52",
          "review": "I tried other movie trackers but they had way too many unnecessary features and confusing interfaces, then I found this one. I've been using it for more than two years! it's my absolute favorite! But now there's a limit on adding movies unless I get premium. I understand that the app needs revenue but this is too much. Movie tracking is the app's most basic function if it is limited then it's useless. Please reconsider. I have too much data here and no way to export I can't/don't want to switch."
        },
        {
          "at": "2025-01-11T00:17:16",
          "review": "I used to love this program but it's a few days that it's not possible to use it as before. It needs to have a primium account but when I want to buy, it shows nothing. I'm really sad about it."
        },
        {
          "at": "2024-12-30T22:50:15",
          "review": "I love this app it's so easy to use in my opinion and I can find everything I want to watch on there!"
        },
        {
          "at": "2024-12-19T17:42:00",
          "review": "Could you please add system default option in the widget theme? So we dont have to change all widgets manually after switching dark or light mode Thanks"
        },
        {
          "at": "2024-12-18T05:20:13",
          "review": "you are one of the best apps.you have a lot movies.i had you at number 3. for real you number 2.keep up the good work.am 62.year old man don't have cable.there nothing on tv."
        },
        {
          "at": "2024-12-05T21:32:22",
          "review": "A cada atualização fica melhor. A interface super limpa e minimalista é o que me faz amar esse app. 🤍"
        },
        {
          "at": "2024-12-02T21:48:44",
          "review": "Literally, this is the only application that I use to watch and browse to get news, new and old movies and series, but lately I can't even see the pictures of movies and series, please fix it"
        },
        {
          "at": "2024-11-11T16:21:19",
          "review": "The devs have decided to limit the number of movies that can be added in the free version! Unfortunately, I only found out after manually transferring them one by one from TV Time. It’s frustrating to find out after you’ve already added all your data and when there’s still no option to export it. At least add this limit clearly in the description. EDIT: the limit has been removed!"
        },
        {
          "at": "2024-11-05T22:11:03",
          "review": "It is incredible what they have done with the app. It was not enough with the constant ads than now there is a limit to how many films can you check as seen and out of sudden you can extended it if you pay. Lamentable, the developers are going to lose a lot of users with this greedy maneuver. Edit: Thank you for making this change, I really appreciate the gesture"
        },
        {
          "at": "2024-10-21T19:54:20",
          "review": "Why did you implement limit to add movies to watch list for the free version? You show so many freaking ads still set a limit. Wow. Edit: Thank you for your generosity. I do click ads to send some revenue over. Your forever price is high for me. I do understand the server costs being high. I do hope we can find some middle ground to have a win win situation. Once again Thank you."
        },
        {
          "at": "2024-10-21T19:01:08",
          "review": "They limited amount of movies you can add to watchlist and history, lame, greedy, do not bother 😒 Edit. Limitation were not reverted as I still can't add movies to history or watchlist Edit 2. I received premium access. I was finally able to add movies to history and watchlist. I thank the developer for this even though it's undeserved as I didn't/couldn't pay for it I will totally say this app is THE BEST for movies and TV shows tracking so please use it!"
        },
        {
          "at": "2024-10-21T03:42:51",
          "review": "A really good app for tracking TV shows and movies. I particularly like being able to get notifications about when new episodes come out and a calendar widget to see when new shows come out (wish the widget followed material theming but otherwise)"
        },
        {
          "at": "2024-08-19T15:52:28",
          "review": "I have been using this app for some time. Very useful for me. I would like to have a language filter. Think about that team."
        },
        {
          "at": "2024-07-20T16:41:50",
          "review": "know you can do this one 1⃣ my first day off and the way but your self is very much a little different from the way"
        },
        {
          "at": "2024-06-20T17:19:04",
          "review": "fantastic app. minimal. organised. however, one minor issue/inconvenience i've noticed, is the trailers section. most of the times it shows clips, sometimes spoilers of the movie/show, when all i want to see is the official trailer. please fix this by either pushing the trailers first or adding another section for clips, interviews... etc."
        },
        {
          "at": "2024-06-02T23:24:41",
          "review": "Personally I think it's a good app because for me there is no adds and it has every movie I want to watch."
        },
        {
          "at": "2024-04-19T06:26:34",
          "review": "it is like your video will resume after to the to you too dear sister please find attached the following the following up on this number or no hi to hai hi nahi"
        },
        {
          "at": "2024-02-10T19:37:13",
          "review": "You could be inspired by letterbox. We can follow our friends, see their activities, create our bio, share ours lists and share on stories from instagram. But this is just suggestions. This is the most complete app i ever seen. Guys, you are great, deserve more than 5 stars <3"
        },
        {
          "at": "2024-01-22T05:10:34",
          "review": "really love this app, have been using it for about a year now. it is my absolute favourite. has any movie or series you can think about. i understand it always develops but adding an ability to create a friend list, to see what movies someone watched, their ratings and reviews in this app would be really nice. anyways, thank you a lot for your hard work😊"
        },
        {
          "at": "2023-10-31T19:27:25",
          "review": "Really love the new style. Looks cool on amoled screen. Good job, mate. Still the best app for tracking movies and tv shows. Truly recommended."
        },
        {
          "at": "2023-10-31T12:59:24",
          "review": "Most definitely, the best movie and TV tracker available. I've tried them all, and nothing compares. The only question I have is that, is the Moviebase app in Microsoft Store made by the same people. It has the identical icon, although by only seeing 2 screenshots, it seems to lacking the UI and features. Could you please confirm as I would love to use this app on my PC. Thank you."
        },
        {
          "at": "2023-10-15T21:37:54",
          "review": "This is a good app for keeping tracked of what I've watched and when films and series are coming out"
        },
        {
          "at": "2023-09-30T15:21:53",
          "review": "Hi it's a great app, I give it 5 you can watch and download a movie, there is no lot of ad's keep it up."
        },
        {
          "at": "2023-09-19T00:10:45",
          "review": "Everything is perfect. I just want to suggest that you can add a button or something that can suggest random movies or series. And please add tomatometer reviews."
        },
        {
          "at": "2023-09-01T21:34:01",
          "review": "brings together my tv and movie history and progress. very simple. active developer. go premium!! read the description: this is NOT a streaming app!! you CANNOT watch tv shows or movies!! Don't downvote the app because of your own neglect."
        },
        {
          "at": "2023-08-31T09:50:21",
          "review": "This is a fantastic app, I don't know what I would do without it. They're just too many TV shows and movies to keep track of the old-fashioned way. The developer super responsive to any issues I have experienced, so I have zero complaints."
        },
        {
          "at": "2023-07-30T04:36:10",
          "review": "The best content data base App And it will be Great if you add some features like the ability to link other data base websites, and ability to create a variable list like a list for people or a list for people and content."
        },
        {
          "at": "2023-07-09T21:50:15",
          "review": "Having been a while on the app, I finally find it perfect, wish I could have a way to transfer my trakt content to the moviebase in case the former gets deleted for some reason in the future."
        },
        {
          "at": "2023-02-23T20:56:00",
          "review": "it's one of the best movie app it contains all the kinds of movies we u need it's better u got it now"
        },
        {
          "at": "2023-02-16T14:04:05",
          "review": "I have tried a lot of apps that use the Trakt API and this one is by far the best! I just bought my lifetime premium and it is totally worth it! I had one request though, we currently have the \"Upcoming Schedule\" category in the home, but it currently only works with shows. Would it be possible to get the same thing for movies as well? That would be great, thanks for creating this app!"
        },
        {
          "at": "2023-02-12T17:27:17",
          "review": "Great Application to Browse Movies. But One request , Can you add option to change grid size , I would love to see larger poster size by Such as 2 × 2 , Grid size of 2"
        },
        {
          "at": "2023-02-06T21:05:15",
          "review": "Muy buena aplicación, te permite organizar tus películas y series e incluso llevar un seguimiento de los episodios que llevas vistos, realmente me encantó esta app."
        },
        {
          "at": "2023-01-14T19:16:00",
          "review": "Love this app. I track all the movies, series and episodes we watch. We can see when new episodes are comming out and see at a glance how far in we were. Looks good and is easy to use - Great app!"
        },
        {
          "at": "2022-12-10T23:31:49",
          "review": "The app is an all-in-one super app for any and all thing related to Movies and TV series. UI is very good and highly customisable."
        },
        {
          "at": "2022-08-30T03:13:58",
          "review": "Great to be able to see programs available for services such as Netflix, with ratings and access to related program information right there."
        },
        {
          "at": "2022-08-18T10:21:49",
          "review": "easy to use.and helpful to wishlist movies and webseries also it properly notify the release dateof.all movies.and.webseries"
        },
        {
          "at": "2022-07-12T18:51:37",
          "review": "thanks for your time and happiness together for your number and I'll be there in about an hour and a"
        },
        {
          "at": "2022-07-09T01:20:31",
          "review": "I like no I taketh back ilove movie app a like like show time the movie Channel and tube and Pluto and movie. movie movie over all let's just say I am a movie freak thank you very munch"
        }
      ]
    },
    "in": {
      "1": [
        {
          "at": "2025-05-31T05:09:59",
          "review": "The app has added an excessive number of ads, so much so that just switching between each episode or tab, a full-screen ad interrupts the experience. This is a deal breaker for me, and I'll switch to another app as soon as possible. This was one of the best apps I've used, goodbye dear old friend"
        },
        {
          "at": "2025-05-07T04:10:53",
          "review": "it's bad and it's not for free and my son hate it and me too pls make this app for free and make the movie for free"
        },
        {
          "at": "2025-04-28T19:38:01",
          "review": "this app limits the amount of movies you can mark as watched for free users after the latest update, that makes it completely unusable, i can't mark movies as watched anymore. I have seen greedy people before but never like this. The most basic function can't be behind the paywall."
        },
        {
          "at": "2025-04-23T12:35:05",
          "review": "The app was declining in quality but it's absolutely unusable now, my trakt progress cannot be synced at all and the app just keeps pushing for premium. My entire collection of history just stopped showing up on the app. Luckily my progress is still available on the trakt account and they have a decent app which should do for now. Thoroughly disappointed, can't believe I spent 18 dollars for a year and as soon as the subscription ended the devs just treat it's non premium members like trash."
        },
        {
          "at": "2025-04-14T09:15:30",
          "review": "Have you seriously put the ability to mark something as watched behind a paywall after the latest update? I've had no issue with all the ads that pop up but you're taking the piss with this now. It's just greed at this point! I'll be uninstalling and using a different app from now on to connect my Trakt too. Absolutely shameful!"
        },
        {
          "at": "2025-04-11T16:50:27",
          "review": "This isn't for me.... It shows you content but no option to watch... Instead it directs you to netflix or prime.. I'm unable to use those because I don't have accounts with them... So Thanks but no thanks. This site has no database."
        },
        {
          "at": "2025-04-08T02:35:57",
          "review": "there were ads in every apps . but this is aaaah . on every click like some cheap website. hhha uninstalled"
        },
        {
          "at": "2025-03-28T10:13:04",
          "review": "it will pass you to another site to watch movies or series, this app is TRASH! don't waste your time in this bullcrap app. 😡"
        },
        {
          "at": "2025-03-23T03:07:34",
          "review": "I am not paying for anything and I shouldn't have to because there's plenty of apps that will give me free movies"
        },
        {
          "at": "2025-02-15T20:51:11",
          "review": "Not Syncing with Trakt after 5.2.5 update please dont mess with this app it used to be a special good app on the store last years you will lose its popularity and hard work in the next months many apps will be introducing and having many features with ai which make this app dissapper"
        },
        {
          "at": "2025-02-12T20:28:47",
          "review": "Excessive ads make it difficult to use the app properly. The frequent and mandatory ads ruin the user experience."
        },
        {
          "at": "2025-01-05T04:09:17",
          "review": "more than i trusive ads, i mean have ads but dont make it get in the way, prompts payment on first open"
        },
        {
          "at": "2025-01-02T06:07:33",
          "review": "Was a subscriber but after the removal of tbdb login I removed the app and cancelled the subscription. Very bad behavior to change core functionality for paying customers. Comment from Moviebase team is not accurate, tmdb login is removed and this is not a bug."
        },
        {
          "at": "2025-01-01T06:40:25",
          "review": "Used to be great. Now it's just constant adverts. With the latest update, all my history and watch lists have been deleted, with the aim of making me subscribe. These tactics are a real turn off."
        },
        {
          "at": "2024-12-31T23:42:51",
          "review": "Totally SUCKS!!! Complete AD supported!!! Never had ads before!!! Everything AD you AD touch AD there's AD an AD ad!!!"
        },
        {
          "at": "2024-12-28T09:36:34",
          "review": "Ads are so frequent and repetitive than before. I don't really mind ads in general especially when they're designed in a way that's bearable and you don't feel their presence that strongly. This app used to be so much better, but after some unnecessary updates (or probably just the developers' wish for it to be that way) I now have to look at ads -now mostly videos that you cannot even skip in a second or two but 10 or more- more than I see other content in the app. Fix this please."
        },
        {
          "at": "2024-12-28T08:21:02",
          "review": "Used to be my favorite app to track movies but it fell off hard. You have to watch a 15 second ad every time you click on something before it even loads the page. I don't mind apps with ads because I know developers need to cover costs but this is very excessive and very annoying to use. I will be moving to a different movie tracker"
        },
        {
          "at": "2024-12-20T23:24:43",
          "review": "Wow that was uncalled for. Now ill have to find another app and re-check hundreds of movies. As if the ads arent enough. Was top of the top untill you implemented a limit. Too bad"
        },
        {
          "at": "2024-12-19T18:26:33",
          "review": "My TV shows have glitched. For example, the bachelorette, season 20 says there are 10 episodes,but only nine of them are showing up ,so you can't check off your progress. So, in turn, it glitches,and you are unable to have it moved over to your upcoming side because it wants to stay on the current tab as if you've not watched those episodes. You can't check that off completely, so it's just stuck. No response or fix on the issue from them. This is still an ongoing issue. Please fix it."
        },
        {
          "at": "2024-12-08T23:36:20",
          "review": "I made an account and it nuked 2 hours of my progress just listing things. It also shoves ads in your face annoyingly, and the summaries for shows and movies never loads. I'm uninstalling immediately."
        },
        {
          "at": "2024-11-25T23:07:12",
          "review": "I'm soo pissed off to find out that this app doesn't provide actually movies..just images here and there not even movie tape"
        },
        {
          "at": "2024-11-13T21:32:12",
          "review": "You have to like buy a movie this app is the worst there is also some subscription man this app sucks"
        },
        {
          "at": "2024-10-20T15:03:42",
          "review": "I assume once I download this app I was going to go on the movie or show or whatever to watch and be like okay I'm going to watch it no you think you going to watch something that's a lie . So this app is fake & its spam. Y'all pay people to say false statements or they high or not smart. I'm sorry to say. So I'm deleting this fake app"
        },
        {
          "at": "2024-09-21T20:26:18",
          "review": "Would be nice to know you charge R340+ a year to \"keep track\" of my movies and series BEFORE I downloaded the app. I'll rely on notifications, thanks. App deleted."
        },
        {
          "at": "2024-09-16T10:48:47",
          "review": "The videos must be for free not to be paid for Money is not life ,make them free and it must not have movies for adults only for children e.g lound house,nicky.dicky.ricky.and dorn only like those ones thank you for reading please understand or can u give me a moive app without adults just give suggestions 🙏 thank you 😊"
        },
        {
          "at": "2024-09-13T02:11:31",
          "review": "This amount of trackers is a joke. Making things even worse is the process to disable them. Just disgusting. 30 € Premium Subscription ... Sure :-D"
        },
        {
          "at": "2024-08-22T05:19:22",
          "review": "lit waits until after u subscribe to tell u it's not a streaming service. it keeps you up to date on new movies but you can't watch them.. HAHAHAHA"
        },
        {
          "at": "2024-07-29T00:03:47",
          "review": "This used to be a 5 star app though now it has become practically unusable due to a constant annoying ad that you cannot get out of. This pops up every second time I click on a movie or show making this app a piece of garbage now. Well done greedy developer for destroying what was once a fantastic app. Deleted from my device now!"
        },
        {
          "at": "2024-07-06T02:06:55",
          "review": "This used to be a 4 star rating. Now i get an unskipable ad every single time I click on a movie, rendering the app virtually unusable. What a joke."
        },
        {
          "at": "2024-04-23T20:47:00",
          "review": "I bought a lifetime premium around 2020 or 2021 now they have removed that and now app is also not responding ...thats not a fair thing to do .....that's very wrong."
        },
        {
          "at": "2024-04-21T02:20:40",
          "review": "the best app ever...I can watch any movies I want so nice tho mmm🥰I love it ...you should try it tho❤️"
        },
        {
          "at": "2024-03-25T11:12:58",
          "review": "I bought the premium in 2020 and now they have removed me from premium. The support also isn't responding since last 3-4 days.. I dropped my email. Developers if you are honest do reply and let me know why my premium isn't working."
        },
        {
          "at": "2024-03-15T08:05:05",
          "review": "This is one big fail it shouldn't even be here I didn't even get to watch a movie This app is useless Anyone reading this don't waste your time and data downloading this"
        },
        {
          "at": "2024-03-05T22:53:20",
          "review": "Update: Developer didn't fix the problem, and wouldn't give me a refund. Cancelled subscription. PLEASE STOP ADULT CONTENT FROM POPPING UP WHEN SEARCHING FOR MOVIES."
        },
        {
          "at": "2024-03-05T04:45:07",
          "review": "Changing my review from 5 to 1 star. Suddenly stopped working for me. Tried everything to make it work but nothing happened. It was my favourite app for trakt. Disappointed."
        },
        {
          "at": "2024-02-19T20:03:21",
          "review": "Lots of ads in the app. Better to try other alternatives. Most of the reviews here are by bots with standard wordings and totally unaware of the app.. lol. I was hoping they will reduce the ads after my last review 6 months ago. Better to uninstall and use Cinetrak or trakt apps."
        },
        {
          "at": "2024-02-18T20:08:39",
          "review": "The app seems not functioning from past 3 days...it says \"we dont receive valid data\" please retry. Dev. Please look out"
        },
        {
          "at": "2024-02-01T02:23:01",
          "review": "It was a very neat app before they deleted all the data I had collected with the new update! All my History and Watchlists are gone! And purchasing Premium has not helped!!!"
        },
        {
          "at": "2024-01-22T20:21:12",
          "review": "I don't know why but am in able to watch movie. Without me subscribing I can't watch movie in the app even with data?"
        },
        {
          "at": "2024-01-14T06:42:13",
          "review": "I really don't understand what's going on I wanna watch something and I can't I tap on the movie and I can't see anything"
        },
        {
          "at": "2024-01-08T11:04:30",
          "review": "Updated to the latest version, which then crashes repeatedly, and asks me to buy premium every single time I open it."
        },
        {
          "at": "2023-12-22T08:43:35",
          "review": "Installed. It immediately tried to sell me stuff. Then it didn't have the very first movie I was looking for. Google did. Uninstalled."
        },
        {
          "at": "2023-12-12T03:27:01",
          "review": "it's my first time using this hopefully there are lots of Martial arts Movies that I haven't seen yet"
        },
        {
          "at": "2023-11-22T02:48:22",
          "review": "What's the point of this app? You can't watch movies; you pick your favorite movies and that's it! Very confusing and a complete waste of an app."
        },
        {
          "at": "2023-10-30T01:30:19",
          "review": "Your app keeps closing out after I use the search feature, it seems like your search feature has been disabled."
        },
        {
          "at": "2023-10-01T02:04:53",
          "review": "first open it wanted me to subscribe. why ask to pay for something you have never used? In response to \"if you are unhappy with any of the features, you can contact us at\". I opened the app and was asked to pay. I don't know the features or any clue what I would be paying for. No thank you."
        },
        {
          "at": "2023-08-09T00:14:34",
          "review": "It used to be a great app until last update in July. After July's update, it shows an ad on every click which is extremely annoying. Going to uninstall the app until they fix it. One or two ads should be enough for each session, but an ad for every click is something nobody wants."
        },
        {
          "at": "2023-08-02T15:28:47",
          "review": "I'm finished with your ads &/or subscription prices. You losers that keep being that annoying are Uninstalled & given horrible reviews for wasting people's time without paying them. You're all greedy trolls I'm sick of seeing everywhere. #GoodRiddance"
        },
        {
          "at": "2023-07-23T06:09:34",
          "review": "No. Before this app would work for the first time it wanted access to my google play credit card account, without me ever having used it."
        },
        {
          "at": "2023-06-17T10:19:20",
          "review": "It shows ads only in foreign languages so you can't close them. Every time you click a show or movie"
        },
        {
          "at": "2023-06-16T22:32:16",
          "review": "Asked for my phone number to send pin via sms. I received sms but option for input pin disappeared foor good living me option only to ask again for pin. Every sms is about 3eur so I gave up"
        },
        {
          "at": "2023-05-19T02:06:25",
          "review": "Please don't there to download this app it is rubbish you can't even download videos with it, it only shows pictures only,it Such a Rubbish app"
        },
        {
          "at": "2023-05-18T09:47:32",
          "review": "Now that the official Trakt app is here, makes no sense to pay for an \"annual subscription\" for a third party app. I'd have bought the app if only they sold a lifetime sub instead of yearly, As good as the app maybe, it's just a cash grab."
        },
        {
          "at": "2023-04-03T22:12:01",
          "review": "Won't allow you to watch anything without you Subscribing first !!!!.... Just like ½ of the other movie apps. All they want from you is your...................... \"MONEY\"...\"MONEY\"...\"MONEY\" \"MONEY\"...\"MONEY\"...\"MONEYYYYYYYYYYYY\" !!! p.s. - How did they create those \"FAKE\" ratings ??? Google Play should investigate \"BEFORE\" allowing it in Playstore."
        },
        {
          "at": "2023-03-26T10:37:54",
          "review": "Long time user here, the ads have gotten out of control. Unstoppable 15 second ad everytime you click on a different movie? Useless."
        },
        {
          "at": "2023-03-19T12:21:28",
          "review": "This most scam you should never watch this piece of garbage i hate this packing up i should ever ever ever ever"
        },
        {
          "at": "2023-02-18T00:25:43",
          "review": "They asked immediately money through credit card details as so called \"free\" trial. Why not given areal probation time , maximum 10 days or 30 days, absolutely free, no money, no credit card details, and after this perriod, you can pay, if you are pleased by the quality and the diversity of the films/ movies?!!"
        },
        {
          "at": "2023-02-06T05:13:56",
          "review": "Suddenly I cannot access moviebase anymore as they tell me i need to update. Yet i have the most up-to-date version. That's a one star performance for me."
        },
        {
          "at": "2023-01-25T03:37:36",
          "review": "Not showing rankings from IMDB, Roten Tomatoes, etc. Too many screens to get where you need to go. Ads everywhere. Not an enjoyable experience."
        },
        {
          "at": "2023-01-14T04:36:11",
          "review": "Uninstalled - don't like apps that try to get you to click to open unknown material. Don't care what Livebeam is."
        },
        {
          "at": "2022-11-27T22:11:20",
          "review": "this app takes a long time to open and asks for to much data sharing. i dont mind an ad but not all my personal information to be put on third party sites ."
        },
        {
          "at": "2022-11-17T07:34:23",
          "review": "Every other update breaks one or more parts of the app, the most recent has made it completely unusable as it just shows a pop-up saying to update to the latest version, which it's on, and this pop-up prevents you from using the app at all, can't reinstall because the syncing issues have never been fixed so losing months of logging is the only guarantee from that"
        },
        {
          "at": "2022-10-28T19:00:08",
          "review": "When I started this app for the first time, it showed me immediately a pop-up asking for a rating. I haven't even been possible to test out this app. I find that a very intrusive and pushy!! That is for me already a reason to give one star!"
        },
        {
          "at": "2022-10-19T21:15:48",
          "review": "19th Oct'22 - Originally was an excellent experience 5 Stars! THEN updated to latest version and the intrusive ads have put me completely off from using what otherwise is a fantastic app. Feedback: Totally understand that you need to generate income from Ads and customers can opt for the Ad free paid version. What will help improve the free Ad Version is to follow other popular and successful apps which place a countdown in the top right hand corner with a button to skip ad once the timer ends."
        },
        {
          "at": "2022-08-30T06:29:55",
          "review": "UPDATE: App is not syncing/ loading since the last update!!! This app is amazing, it offers a variety of home customization and keeps track of your watch history."
        },
        {
          "at": "2022-08-16T21:02:55",
          "review": "It is a nice app really because I see both old and new movies and it's not all that expensive It gives a role hobby to your life It brings back the daily Entertainment"
        },
        {
          "at": "2022-07-19T18:11:28",
          "review": "Synchronisation error: Application is not storing the data of watched movies and webseries. When application gone slow and laggy I synchronised and reinstalled app. Now I've lost all data from past 2 months"
        }
      ],
      "2": [
        {
          "at": "2025-05-12T08:09:57",
          "review": "Love the app but when logging in after a fresh download, I can't get past the review screen. the button at the the of the onboarding \"let's explore\" is greyed out. I can't get into the app...."
        },
        {
          "at": "2025-03-11T19:21:10",
          "review": "Best Movie n TV data app.. Really appreciate the new features specially addition of popular review aggregaters...Edit(11/03/25) now the app is not working properly.. many bugs like home page not loading and a search bar not responding etc."
        },
        {
          "at": "2024-12-27T00:20:44",
          "review": "I'll stick with Letterboxed, Serialized & Just Watch. Pop-up ads and what should be basic features being locked are a strong no for me."
        },
        {
          "at": "2024-12-22T08:31:02",
          "review": "It is not clear if this app is for me alone to see I have sounds all aeou d commenting even ruddy views on my fingers moving make Wonly the frame works never ends"
        },
        {
          "at": "2024-10-18T07:41:35",
          "review": "Not at all easy to use, clunky. And then it lost all of my progress. Just when you think you know how to add a show, you don't get the updates for it. I give up."
        },
        {
          "at": "2024-05-04T13:09:50",
          "review": "UNINSTALL App works OK but the update since the last time I used it now has long ads you can't click thru or get out of. Had to watch a ridic long demo ad of a game I will never play then it auto opens in the playstore. Had to hit back 3x to get out of it. This is a stupid amount of effort just to mark a lame movie as watched just to give them my free user data which they'll probably then sell."
        },
        {
          "at": "2024-04-07T20:12:26",
          "review": "I recently installed this app and when I try to synchronise with Trakt, it takes forever. Please fix this issue."
        },
        {
          "at": "2024-03-27T18:40:28",
          "review": "What's happening with this app!! I would be happy to pay the premium but it keeps freezing on me. Doesn't change pages, I have to keep closing it refreshing it does it again. Shame used to be the best movie app ever!! Ruined it."
        },
        {
          "at": "2024-02-04T03:52:35",
          "review": "It used to be a great app, but there are way too many adverts now. Jumping between episodes in a season and I'm getting adverts every 3-4 screens. It's just ridiculous. I think I'll just go back to using Trakt."
        },
        {
          "at": "2023-11-21T13:51:04",
          "review": "You can rate movies/shows and track each episode and season watched, including specials. If you haven't watched yet, it'll say where you can watch. Just hit the app You want to watch on, and it'll take you to that app to watch. Tv time does all this too plus, no ads, and you don't have to pay for a premium membership to be able to comment on what you watch, and you can follow others who watch the same content, and tv time will show you how many total hours you've watched both movie and tv."
        },
        {
          "at": "2023-10-17T15:38:23",
          "review": "UI is a chaotic, disorganized carousel bonanza. If you want an app that's as annoying to scroll as Netflix, here ya go. Not serious competition for Letterboxd"
        },
        {
          "at": "2023-06-16T06:44:57",
          "review": "Needs home button always displayed so I don't have to close out the app or hit back 10x to go back to the home screen. Needs a way to remove a show from my lists if I don't want to watch it anymore or get updates. Otherwise, app is weak."
        },
        {
          "at": "2023-04-25T17:22:16",
          "review": "I like the idea of it, and my first use was fine. Ever since, however, any page I move to gets stuck on the loading screen. I could deal with the long, repetitive ads if I could actually use the app."
        },
        {
          "at": "2023-03-19T03:07:28",
          "review": "i can't synchronize anything with my trakt account (it looks like its can't connect to the service),pls fix the issue,I'll change my review after solving the problem using app on Android 7"
        },
        {
          "at": "2022-12-31T05:33:13",
          "review": "Can you integrate more sorting options for movies? Specially with category type. That's much needed feature. Edit: Last update created a memory leak so app is not usable after 3 mins and phone starts lagging"
        },
        {
          "at": "2022-08-29T06:10:47",
          "review": "No movies available for you to watch: They want you to download other apps for movies, they set up all this stuff and don't have no movies for you to watch or observe!"
        },
        {
          "at": "2022-07-22T22:10:33",
          "review": "The app is nice, but I found some bugs right after installing it. This was a bit disappointing, considering that the app really wants to convince me to buy the premium. For a premium app, I would expect better. Sadly I have to lower my score to 2 stars, as the synchronization from Trakt to Moviebase is not reliable..."
        }
      ],
      "3": [
        {
          "at": "2025-02-01T15:14:57",
          "review": "It was 5 but now 3 stars!!! Excellent app, superb, I love it!!! BUT lately you are showing so much fake scamming ads guys??? Where's the quality and security control??? It really is a shame ... Very disappointed in the last few months about the ads shown!!! Just to be clear: I am not complaining about the ads in general for the free version BUT for the ads leading to SCAM sites"
        },
        {
          "at": "2025-01-14T08:28:41",
          "review": "I wish I could give it 5 stars. But I needed to uninstall and reinstall and now it's showing that I've already purchased the Moviebase Unlimited premium on 10/24/24 through Google Play for $35.08"
        },
        {
          "at": "2024-12-31T11:00:31",
          "review": "I really like using this app but it's absurd to constantly be advertising the developer's other apps in the top half of the screen (in a paid subscriber). Please respect your customers."
        },
        {
          "at": "2024-11-10T02:08:57",
          "review": "Great app, but keep an eye out on the privacy permissions. 128 vendors want access to your data, with a dozen of toggles to disable."
        },
        {
          "at": "2024-10-10T16:33:18",
          "review": "Amazing app however it has someone issues specially when i try to to sign in to my account from another device. I removes some of the movies TV shows delete some of of the watched content remove some from my personal lists etc it is like it did not get all the data that is stored in my account into the new device"
        },
        {
          "at": "2024-07-09T15:30:44",
          "review": "Please I mistakenly subscribe in this app and I really need a refund please the money is not mine please help me..."
        },
        {
          "at": "2024-05-12T21:32:05",
          "review": "App good. But work on past bugs. Widget and app still does not refresh new upcoming content unless you manually sync by opening app and pull down to sync"
        },
        {
          "at": "2024-04-20T17:22:00",
          "review": "Decent app, but could be a lot better. Most of the home screen categories are terribly curated. I don't care what's going to be on DVD in 2031. Also, I just want to be able put my own notes on the movies I watch without having to write a review."
        },
        {
          "at": "2024-04-02T17:19:46",
          "review": "This app is very helpful and useful when it comes to movies , all kind of movies. I have used it for about 1 year"
        },
        {
          "at": "2024-02-25T03:18:43",
          "review": "It's such a good movie log app but there has been a bug for a while where the lists I have flash and then the screen goes black. I can still add to the lists but I can hardly see them and it's super annoying."
        },
        {
          "at": "2024-02-21T22:30:32",
          "review": "I used to love moviebase for its userinterface design but after this new update the app homescreen and it keeps on loading the icons. I have even tried to uninstall and reinstall but after installing and connecting to trackt it keeps on syncing and it doesn't end. At this point i cant use app in any manner. Fix this asap"
        },
        {
          "at": "2023-11-25T16:59:51",
          "review": "You have a good app here. Even subbed. Could use improvement though. 1. LET US..ADD A PICTURE & CHANGE EMAIL AND OUR USERNAME ON OUR PROFILE WITHOUT HAVING TO SIGN UP AGAIN WITH A NEW ACCOUNT 2. Let us..be able to RECOVER OUR ACCOUNT WITHOUT EMAIL in case we forget our sign up email 3. Let us..ADD THE MOVIE PRODUCTION COMPANIES that you have IN SEARCH to our PERSONAL LISTS and, 4. ADD MGM, A24 & BLUMHOUSE TO PRODUCTION COMPANIES. Once THESE things are addressed, FIVE stars all the way!"
        },
        {
          "at": "2023-05-19T07:08:50",
          "review": "Don't know how many stars to give this app because in one hand I really like this app on my Android and the features are super useful for me but in other hand I miss this app on my iOS devices like my iPad and Mac! I don't wanna use 2 or 3 different apps for the same purpose so It would be really appreciated if the developers bring iOS support or atleast a webapp would work too!"
        },
        {
          "at": "2023-03-05T16:11:36",
          "review": "Great app . But some movies relese year is wrong and we cant search by name with year. Please correct the release years of some movies"
        },
        {
          "at": "2023-01-30T10:00:53",
          "review": "One of the nicer Trakt apps available, but it needs some changes to really focus on the management of Trakt data. {-1-} There needs to be more immediate access to Collection, Personal Lists, and Watchlist. I'd suggest doing this by allowing for the removal / replacement of bottom-row tabs like Home, Search, and TV Shows. {-2-} Please add a prompt before removing something from Collection (keep the Undo prompt too, but please prompt before actually removing in the 1st place.)"
        },
        {
          "at": "2022-12-30T20:13:14",
          "review": "Everything works perfectly but in synchronization tab nothing works! I can't sync data with my trakt!! plsss tell me how to fix this issue ♡"
        },
        {
          "at": "2022-09-05T05:34:15",
          "review": "This app is getting very irritating. It keeps taking shows off of my watchlist without my knowledge. Why does it keep doing this!? It's very annoying, and this doesn't show movies and tv show recom from Amazon Prime video and Crave."
        },
        {
          "at": "2022-09-02T01:33:29",
          "review": "Good app but unstable due to ADs, works great when I block ADs using custom DNS but as soon as I disable custom DNS app starts freezing quite often, expecially when opening the app."
        },
        {
          "at": "2022-07-29T08:30:54",
          "review": "It's the best-looking Trakt companion app I've used on Android so far, but it would be so much better if the preferred rating source was shown in list view. I'd like to use this app to skim for movies I'll like, but I have to click on each movie to see the IMDB rating. The Trakt ratings simply don't have a large enough sample of voters."
        }
      ],
      "4": [
        {
          "at": "2024-11-10T12:14:25",
          "review": "App is working now. But there's some problem with syncing with trakt, if I update from trakt directly, it takes time for app to show up in it even though No delay is set in settings. Sometimes it doesn't even show it at all even later."
        },
        {
          "at": "2024-07-21T03:49:52",
          "review": "I've tried every movie tracking app, it could be the best but it needs two crucial options: 1. Don't show watched movies in recommendations 2. Giving more interesting insights"
        },
        {
          "at": "2024-05-20T03:11:27",
          "review": "I will see you and I will tell you because it is good or not good I don't know that's why and you can give me parmision I will see and I will tell anything is ther problem I will report tomorrow is partnership with photo this photo update the status of my number is not reachable by hi nahi hai taiyari shuru me athato matladathaava in Telugu h in logo ko i in Telugu i of the dragon Ball dragon movie in Telugu Telugu dubbed I want to you pranathi in Telugu movie in Telugu Telugu dubbed movies"
        },
        {
          "at": "2024-04-27T09:56:41",
          "review": "One of the best (if not the best) app for anything Movies/TV related. Only downside is that for the backup function you need to buy the premium version. But I think I will pay for this app. (Take my money)."
        },
        {
          "at": "2024-04-13T18:18:41",
          "review": "I've been using the app for a few days, I like it, useful and easy to understand, but please add more features like more content details especially a Parental Guid, and settings like importing personal library and watchlist from other platforms like IMDb. Keep working 💪 It will be great if you add a feature to export some movie or show as a well-organised screenshot or card (with the important infos) to save it or send it to someone 🙏"
        },
        {
          "at": "2024-03-19T23:10:39",
          "review": "great app and also reminder for all your favorite serie but can add something like up coming movie but guyzzz great jobs with the app"
        },
        {
          "at": "2024-01-06T08:41:28",
          "review": "Type @ in the comments below and select highlight to see who normally check your profile.If it turns blue then you got page watchers"
        },
        {
          "at": "2023-11-24T21:00:09",
          "review": "Good app, but it's recent versions (incl. 4.6.5) have an annoying issue. It is capable to create backups but is not able to restore it"
        },
        {
          "at": "2023-11-01T23:45:54",
          "review": "Being a user of Anilist (anime tracker), if this app could replicate its features, it would easily be a 5/5. Many things missing but its heading in a good direction. One of my favourite features is franchise grouping and seeing the connectied movies"
        },
        {
          "at": "2023-10-07T23:49:15",
          "review": "I really enjoy this application use it almost everyday. The only change I really would like to see if a setting to hide anime/cartoons as I find it's congested with it, unfortunately."
        },
        {
          "at": "2023-09-10T13:03:26",
          "review": "recently I reinstalled the app, to give it another chance... and I was surprised for good... after 20 months, this app has improved a lot... it has more functions that other apps - customizing homepage with various categories, easier tracking, more information about the titles, including the cast, and as always phenomelan UI... two things I would change - dont ask for the date when adding older shows, and add more regions... hopefully I will give 5 stars next time..."
        },
        {
          "at": "2023-09-01T03:04:05",
          "review": "New update looks better with the orange search removed. The TV section is sleaker, the minimalist selector for progress and upcoming looks good. The movie section however, I'm not a fan of the giant pill shaped selector at the top, much prefer the tv show design. Movie sorting works for history and watchlist, thanks for fixing that! Just noticed that there isn't a to watch section in TV, definitely needs to be added. Thanks for the updates and for making the best media tracker!"
        },
        {
          "at": "2023-07-25T15:03:25",
          "review": "I would like to be able to disable the season and episode section in watchlist and also be able to set IMDb rating in the list view as well , thank you"
        },
        {
          "at": "2023-07-21T20:37:36",
          "review": "Love it. Can we have more filters in the search tab? Also a \"hide watched\" option in search would be great"
        },
        {
          "at": "2023-03-03T01:12:27",
          "review": "Looks good so far. Do not understand why this app along with a few others don't have a section for Oscar or Golden Globe nominated movies."
        },
        {
          "at": "2023-01-15T23:02:21",
          "review": "It has been 2 years now using it and I initially voted 5/5 but recently I cant give it more than 4/5! It has very good features, continuesly updated one of them, but one feature that many other similar have and this doesn't is the show/use the Rotten tomatoes or/and Metacritic score/reviews. And that is in my opinion, a shortcoming when compared to other apps (especially Watcht, which I used before passing to Android). I hope in the future upgrades this will be fixed."
        },
        {
          "at": "2023-01-06T10:15:27",
          "review": "ALERT: I never give 5 stars in rating. This app is just the best. Their UI is state of the art. Their features are top of the class. And I am not even a premium user. P.S. Check out the Recommendation section in shows. The recommendation section in every show is.. is.. THE BEST. For every movie, every series, the recommendation I got, either matched what I previously watched or am watching now. And they aren't just similar to it. There's a similar section also, which houses shows similar to it."
        },
        {
          "at": "2022-12-31T16:46:04",
          "review": "I have been a premium user of this for more than a year. The app is great but some important features are missing.⁉️ 1️⃣. There should be an option to keep track of upcoming movies on my watchlist. 2️⃣. In the TV Shows progress section there should be an option to put shows on hold. (Currently, there is only an option to hide shows)"
        },
        {
          "at": "2022-12-05T23:48:28",
          "review": "Really nice UI layout, poster are clear and in good detail, options and settings are abudant, really pleased with application, would love to see the ability to customise some of the menus, such as being able to remove/hide things like seasons and episodes from the watchlist category etc...and also being able to view Trakt liked lists."
        },
        {
          "at": "2022-11-19T23:58:29",
          "review": "My goto Trakt.tv client on android! Absolutely perfect in every which way. The only thing I'd suggest the Developer is the suggestions while searching for an obscure movie -especially anything Asian related content is a hit/miss even though the entries are on TMDb. If that gets fixed, this is a near perfect app."
        },
        {
          "at": "2022-11-10T02:46:28",
          "review": "Beautiful app 👌Just facing one issue: I am getting notifications for new episodes only after opening the app. I am using the Premium version. I thought the app will notify me even without opening it?"
        },
        {
          "at": "2022-10-16T07:33:27",
          "review": "Nice, but I wish all my TV shows will appear on the upcoming, because if for example I havent watch a single episode of the show it wont add up to the upcoming. But once I watched an episode of the show it will show up on the upcoming."
        },
        {
          "at": "2022-08-01T00:34:24",
          "review": "Please add HBO Max as a provider and allow profile user rating sort at least in history for 5 stars."
        },
        {
          "at": "2022-07-15T00:05:40",
          "review": "Hi! Love the app. Simple and functional. However when trying to synchronise with Trakt I can only sync my watchlists and not my history. Could you please fix this?"
        }
      ],
      "5": [
        {
          "at": "2025-06-24T05:44:04",
          "review": "Thank You For Sharing Your Experience And Always Supporting Us Daily Watching Great Movies Every Day. Thank You For Showing Your Experience. Keep It Up 💯."
        },
        {
          "at": "2025-06-14T14:28:54",
          "review": "thanks for introducing this app to me. though dis is d first time of using it, know that you will not be boring when using it. thanks Welcome to Gboard clipboard, any text you copy will be saved here."
        },
        {
          "at": "2025-05-20T17:56:37",
          "review": "love the app.... krueger you are awesome. thanks for reverting the watchlist limit, if you are out of money do one thing add buy me a coffee button I would be the first to be helper for the server cost but don't limit the list count"
        },
        {
          "at": "2025-04-29T02:10:54",
          "review": "I would like to give 5 stars to this amazing and interesting app, I truly recommended this app to everyone!"
        },
        {
          "at": "2025-04-21T11:08:44",
          "review": "I've used Moviebase for years and I love it. Any issues that are bought up to the developer are worked on straight away, and you always feel listened to when raising concerns. I use premium, but the free version is fully usable and the premium isn't necessary if you aren't wanting to pay. I will continue using Moviebase as unlike other tracking apps, they don't put limits on lists or watchlists."
        },
        {
          "at": "2025-03-27T19:21:59",
          "review": "thanks for your wonderful app. have a question. how can I separate my account in moviebase from traktv? is there any way? because I usually login with my traktv account"
        },
        {
          "at": "2025-03-14T18:31:49",
          "review": "wow, it's such a Nice one... Great apps you can trust Anytime Anywhere, with reliable trust for Downloads, stress less with fast network wave, I advise you give this App a trial and share your testimony just like me... 👍👍"
        },
        {
          "at": "2025-03-12T03:59:05",
          "review": "Great app! I’d appreciate a feature that allows movies within a list to be arranged in a custom order, making it possible to create personalized ranking lists. Additionally, the ability to share these lists—potentially including my own ratings—with friends would be fantastic!"
        },
        {
          "at": "2025-03-11T18:06:49",
          "review": "I love this app, but I have decided to switch from Trakt to SIMKL after they limited the watchlist for normal users. It would be great if I could continue using this app with SIMKL."
        },
        {
          "at": "2025-02-20T12:10:43",
          "review": "Great UI design, resonable pricing. I'd like to move away from trakt, anyway to export data to moviebase or tmdb?"
        },
        {
          "at": "2025-02-10T13:49:52",
          "review": "I tried other movie trackers but they had way too many unnecessary features and confusing interfaces, then I found this one. I've been using it for more than two years! it's my absolute favorite! But now there's a limit on adding movies unless I get premium. I understand that the app needs revenue but this is too much. Movie tracking is the app's most basic function if it is limited then it's useless. Please reconsider. I have too much data here and no way to export I can't/don't want to switch."
        },
        {
          "at": "2025-01-11T00:17:16",
          "review": "I used to love this program but it's a few days that it's not possible to use it as before. It needs to have a primium account but when I want to buy, it shows nothing. I'm really sad about it."
        },
        {
          "at": "2024-12-30T22:50:15",
          "review": "I love this app it's so easy to use in my opinion and I can find everything I want to watch on there!"
        },
        {
          "at": "2024-12-19T17:42:00",
          "review": "Could you please add system default option in the widget theme? So we dont have to change all widgets manually after switching dark or light mode Thanks"
        },
        {
          "at": "2024-12-18T05:20:13",
          "review": "you are one of the best apps.you have a lot movies.i had you at number 3. for real you number 2.keep up the good work.am 62.year old man don't have cable.there nothing on tv."
        },
        {
          "at": "2024-12-05T21:32:22",
          "review": "A cada atualização fica melhor. A interface super limpa e minimalista é o que me faz amar esse app. 🤍"
        },
        {
          "at": "2024-12-02T21:48:44",
          "review": "Literally, this is the only application that I use to watch and browse to get news, new and old movies and series, but lately I can't even see the pictures of movies and series, please fix it"
        },
        {
          "at": "2024-11-11T16:21:19",
          "review": "The devs have decided to limit the number of movies that can be added in the free version! Unfortunately, I only found out after manually transferring them one by one from TV Time. It’s frustrating to find out after you’ve already added all your data and when there’s still no option to export it. At least add this limit clearly in the description. EDIT: the limit has been removed!"
        },
        {
          "at": "2024-11-05T22:11:03",
          "review": "It is incredible what they have done with the app. It was not enough with the constant ads than now there is a limit to how many films can you check as seen and out of sudden you can extended it if you pay. Lamentable, the developers are going to lose a lot of users with this greedy maneuver. Edit: Thank you for making this change, I really appreciate the gesture"
        },
        {
          "at": "2024-10-21T19:54:20",
          "review": "Why did you implement limit to add movies to watch list for the free version? You show so many freaking ads still set a limit. Wow. Edit: Thank you for your generosity. I do click ads to send some revenue over. Your forever price is high for me. I do understand the server costs being high. I do hope we can find some middle ground to have a win win situation. Once again Thank you."
        },
        {
          "at": "2024-10-21T19:01:08",
          "review": "They limited amount of movies you can add to watchlist and history, lame, greedy, do not bother 😒 Edit. Limitation were not reverted as I still can't add movies to history or watchlist Edit 2. I received premium access. I was finally able to add movies to history and watchlist. I thank the developer for this even though it's undeserved as I didn't/couldn't pay for it I will totally say this app is THE BEST for movies and TV shows tracking so please use it!"
        },
        {
          "at": "2024-10-21T03:42:51",
          "review": "A really good app for tracking TV shows and movies. I particularly like being able to get notifications about when new episodes come out and a calendar widget to see when new shows come out (wish the widget followed material theming but otherwise)"
        },
        {
          "at": "2024-08-19T15:52:28",
          "review": "I have been using this app for some time. Very useful for me. I would like to have a language filter. Think about that team."
        },
        {
          "at": "2024-07-20T16:41:50",
          "review": "know you can do this one 1⃣ my first day off and the way but your self is very much a little different from the way"
        },
        {
          "at": "2024-06-20T17:19:04",
          "review": "fantastic app. minimal. organised. however, one minor issue/inconvenience i've noticed, is the trailers section. most of the times it shows clips, sometimes spoilers of the movie/show, when all i want to see is the official trailer. please fix this by either pushing the trailers first or adding another section for clips, interviews... etc."
        },
        {
          "at": "2024-06-02T23:24:41",
          "review": "Personally I think it's a good app because for me there is no adds and it has every movie I want to watch."
        },
        {
          "at": "2024-04-19T06:26:34",
          "review": "it is like your video will resume after to the to you too dear sister please find attached the following the following up on this number or no hi to hai hi nahi"
        },
        {
          "at": "2024-02-10T19:37:13",
          "review": "You could be inspired by letterbox. We can follow our friends, see their activities, create our bio, share ours lists and share on stories from instagram. But this is just suggestions. This is the most complete app i ever seen. Guys, you are great, deserve more than 5 stars <3"
        },
        {
          "at": "2024-01-22T05:10:34",
          "review": "really love this app, have been using it for about a year now. it is my absolute favourite. has any movie or series you can think about. i understand it always develops but adding an ability to create a friend list, to see what movies someone watched, their ratings and reviews in this app would be really nice. anyways, thank you a lot for your hard work😊"
        },
        {
          "at": "2023-10-31T19:27:25",
          "review": "Really love the new style. Looks cool on amoled screen. Good job, mate. Still the best app for tracking movies and tv shows. Truly recommended."
        },
        {
          "at": "2023-10-31T12:59:24",
          "review": "Most definitely, the best movie and TV tracker available. I've tried them all, and nothing compares. The only question I have is that, is the Moviebase app in Microsoft Store made by the same people. It has the identical icon, although by only seeing 2 screenshots, it seems to lacking the UI and features. Could you please confirm as I would love to use this app on my PC. Thank you."
        },
        {
          "at": "2023-10-15T21:37:54",
          "review": "This is a good app for keeping tracked of what I've watched and when films and series are coming out"
        },
        {
          "at": "2023-09-30T15:21:53",
          "review": "Hi it's a great app, I give it 5 you can watch and download a movie, there is no lot of ad's keep it up."
        },
        {
          "at": "2023-09-19T00:10:45",
          "review": "Everything is perfect. I just want to suggest that you can add a button or something that can suggest random movies or series. And please add tomatometer reviews."
        },
        {
          "at": "2023-09-01T21:34:01",
          "review": "brings together my tv and movie history and progress. very simple. active developer. go premium!! read the description: this is NOT a streaming app!! you CANNOT watch tv shows or movies!! Don't downvote the app because of your own neglect."
        },
        {
          "at": "2023-08-31T09:50:21",
          "review": "This is a fantastic app, I don't know what I would do without it. They're just too many TV shows and movies to keep track of the old-fashioned way. The developer super responsive to any issues I have experienced, so I have zero complaints."
        },
        {
          "at": "2023-07-30T04:36:10",
          "review": "The best content data base App And it will be Great if you add some features like the ability to link other data base websites, and ability to create a variable list like a list for people or a list for people and content."
        },
        {
          "at": "2023-07-09T21:50:15",
          "review": "Having been a while on the app, I finally find it perfect, wish I could have a way to transfer my trakt content to the moviebase in case the former gets deleted for some reason in the future."
        },
        {
          "at": "2023-02-23T20:56:00",
          "review": "it's one of the best movie app it contains all the kinds of movies we u need it's better u got it now"
        },
        {
          "at": "2023-02-16T14:04:05",
          "review": "I have tried a lot of apps that use the Trakt API and this one is by far the best! I just bought my lifetime premium and it is totally worth it! I had one request though, we currently have the \"Upcoming Schedule\" category in the home, but it currently only works with shows. Would it be possible to get the same thing for movies as well? That would be great, thanks for creating this app!"
        },
        {
          "at": "2023-02-12T17:27:17",
          "review": "Great Application to Browse Movies. But One request , Can you add option to change grid size , I would love to see larger poster size by Such as 2 × 2 , Grid size of 2"
        },
        {
          "at": "2023-02-06T21:05:15",
          "review": "Muy buena aplicación, te permite organizar tus películas y series e incluso llevar un seguimiento de los episodios que llevas vistos, realmente me encantó esta app."
        },
        {
          "at": "2023-01-14T19:16:00",
          "review": "Love this app. I track all the movies, series and episodes we watch. We can see when new episodes are comming out and see at a glance how far in we were. Looks good and is easy to use - Great app!"
        },
        {
          "at": "2022-12-10T23:31:49",
          "review": "The app is an all-in-one super app for any and all thing related to Movies and TV series. UI is very good and highly customisable."
        },
        {
          "at": "2022-08-30T03:13:58",
          "review": "Great to be able to see programs available for services such as Netflix, with ratings and access to related program information right there."
        },
        {
          "at": "2022-08-18T10:21:49",
          "review": "easy to use.and helpful to wishlist movies and webseries also it properly notify the release dateof.all movies.and.webseries"
        },
        {
          "at": "2022-07-12T18:51:37",
          "review": "thanks for your time and happiness together for your number and I'll be there in about an hour and a"
        },
        {
          "at": "2022-07-09T01:20:31",
          "review": "I like no I taketh back ilove movie app a like like show time the movie Channel and tube and Pluto and movie. movie movie over all let's just say I am a movie freak thank you very munch"
        }
      ]
    },
    "cn": {
      "1": [
        {
          "at": "2025-05-31T05:09:59",
          "review": "The app has added an excessive number of ads, so much so that just switching between each episode or tab, a full-screen ad interrupts the experience. This is a deal breaker for me, and I'll switch to another app as soon as possible. This was one of the best apps I've used, goodbye dear old friend"
        },
        {
          "at": "2025-05-07T04:10:53",
          "review": "it's bad and it's not for free and my son hate it and me too pls make this app for free and make the movie for free"
        },
        {
          "at": "2025-04-28T19:38:01",
          "review": "this app limits the amount of movies you can mark as watched for free users after the latest update, that makes it completely unusable, i can't mark movies as watched anymore. I have seen greedy people before but never like this. The most basic function can't be behind the paywall."
        },
        {
          "at": "2025-04-23T12:35:05",
          "review": "The app was declining in quality but it's absolutely unusable now, my trakt progress cannot be synced at all and the app just keeps pushing for premium. My entire collection of history just stopped showing up on the app. Luckily my progress is still available on the trakt account and they have a decent app which should do for now. Thoroughly disappointed, can't believe I spent 18 dollars for a year and as soon as the subscription ended the devs just treat it's non premium members like trash."
        },
        {
          "at": "2025-04-14T09:15:30",
          "review": "Have you seriously put the ability to mark something as watched behind a paywall after the latest update? I've had no issue with all the ads that pop up but you're taking the piss with this now. It's just greed at this point! I'll be uninstalling and using a different app from now on to connect my Trakt too. Absolutely shameful!"
        },
        {
          "at": "2025-04-11T16:50:27",
          "review": "This isn't for me.... It shows you content but no option to watch... Instead it directs you to netflix or prime.. I'm unable to use those because I don't have accounts with them... So Thanks but no thanks. This site has no database."
        },
        {
          "at": "2025-04-08T02:35:57",
          "review": "there were ads in every apps . but this is aaaah . on every click like some cheap website. hhha uninstalled"
        },
        {
          "at": "2025-03-28T10:13:04",
          "review": "it will pass you to another site to watch movies or series, this app is TRASH! don't waste your time in this bullcrap app. 😡"
        },
        {
          "at": "2025-03-23T03:07:34",
          "review": "I am not paying for anything and I shouldn't have to because there's plenty of apps that will give me free movies"
        },
        {
          "at": "2025-02-15T20:51:11",
          "review": "Not Syncing with Trakt after 5.2.5 update please dont mess with this app it used to be a special good app on the store last years you will lose its popularity and hard work in the next months many apps will be introducing and having many features with ai which make this app dissapper"
        },
        {
          "at": "2025-02-12T20:28:47",
          "review": "Excessive ads make it difficult to use the app properly. The frequent and mandatory ads ruin the user experience."
        },
        {
          "at": "2025-01-05T04:09:17",
          "review": "more than i trusive ads, i mean have ads but dont make it get in the way, prompts payment on first open"
        },
        {
          "at": "2025-01-02T06:07:33",
          "review": "Was a subscriber but after the removal of tbdb login I removed the app and cancelled the subscription. Very bad behavior to change core functionality for paying customers. Comment from Moviebase team is not accurate, tmdb login is removed and this is not a bug."
        },
        {
          "at": "2025-01-01T06:40:25",
          "review": "Used to be great. Now it's just constant adverts. With the latest update, all my history and watch lists have been deleted, with the aim of making me subscribe. These tactics are a real turn off."
        },
        {
          "at": "2024-12-31T23:42:51",
          "review": "Totally SUCKS!!! Complete AD supported!!! Never had ads before!!! Everything AD you AD touch AD there's AD an AD ad!!!"
        },
        {
          "at": "2024-12-28T09:36:34",
          "review": "Ads are so frequent and repetitive than before. I don't really mind ads in general especially when they're designed in a way that's bearable and you don't feel their presence that strongly. This app used to be so much better, but after some unnecessary updates (or probably just the developers' wish for it to be that way) I now have to look at ads -now mostly videos that you cannot even skip in a second or two but 10 or more- more than I see other content in the app. Fix this please."
        },
        {
          "at": "2024-12-28T08:21:02",
          "review": "Used to be my favorite app to track movies but it fell off hard. You have to watch a 15 second ad every time you click on something before it even loads the page. I don't mind apps with ads because I know developers need to cover costs but this is very excessive and very annoying to use. I will be moving to a different movie tracker"
        },
        {
          "at": "2024-12-20T23:24:43",
          "review": "Wow that was uncalled for. Now ill have to find another app and re-check hundreds of movies. As if the ads arent enough. Was top of the top untill you implemented a limit. Too bad"
        },
        {
          "at": "2024-12-19T18:26:33",
          "review": "My TV shows have glitched. For example, the bachelorette, season 20 says there are 10 episodes,but only nine of them are showing up ,so you can't check off your progress. So, in turn, it glitches,and you are unable to have it moved over to your upcoming side because it wants to stay on the current tab as if you've not watched those episodes. You can't check that off completely, so it's just stuck. No response or fix on the issue from them. This is still an ongoing issue. Please fix it."
        },
        {
          "at": "2024-12-08T23:36:20",
          "review": "I made an account and it nuked 2 hours of my progress just listing things. It also shoves ads in your face annoyingly, and the summaries for shows and movies never loads. I'm uninstalling immediately."
        },
        {
          "at": "2024-11-25T23:07:12",
          "review": "I'm soo pissed off to find out that this app doesn't provide actually movies..just images here and there not even movie tape"
        },
        {
          "at": "2024-11-13T21:32:12",
          "review": "You have to like buy a movie this app is the worst there is also some subscription man this app sucks"
        },
        {
          "at": "2024-10-20T15:03:42",
          "review": "I assume once I download this app I was going to go on the movie or show or whatever to watch and be like okay I'm going to watch it no you think you going to watch something that's a lie . So this app is fake & its spam. Y'all pay people to say false statements or they high or not smart. I'm sorry to say. So I'm deleting this fake app"
        },
        {
          "at": "2024-09-21T20:26:18",
          "review": "Would be nice to know you charge R340+ a year to \"keep track\" of my movies and series BEFORE I downloaded the app. I'll rely on notifications, thanks. App deleted."
        },
        {
          "at": "2024-09-16T10:48:47",
          "review": "The videos must be for free not to be paid for Money is not life ,make them free and it must not have movies for adults only for children e.g lound house,nicky.dicky.ricky.and dorn only like those ones thank you for reading please understand or can u give me a moive app without adults just give suggestions 🙏 thank you 😊"
        },
        {
          "at": "2024-09-13T02:11:31",
          "review": "This amount of trackers is a joke. Making things even worse is the process to disable them. Just disgusting. 30 € Premium Subscription ... Sure :-D"
        },
        {
          "at": "2024-08-22T05:19:22",
          "review": "lit waits until after u subscribe to tell u it's not a streaming service. it keeps you up to date on new movies but you can't watch them.. HAHAHAHA"
        },
        {
          "at": "2024-07-29T00:03:47",
          "review": "This used to be a 5 star app though now it has become practically unusable due to a constant annoying ad that you cannot get out of. This pops up every second time I click on a movie or show making this app a piece of garbage now. Well done greedy developer for destroying what was once a fantastic app. Deleted from my device now!"
        },
        {
          "at": "2024-07-06T02:06:55",
          "review": "This used to be a 4 star rating. Now i get an unskipable ad every single time I click on a movie, rendering the app virtually unusable. What a joke."
        },
        {
          "at": "2024-04-23T20:47:00",
          "review": "I bought a lifetime premium around 2020 or 2021 now they have removed that and now app is also not responding ...thats not a fair thing to do .....that's very wrong."
        },
        {
          "at": "2024-04-21T02:20:40",
          "review": "the best app ever...I can watch any movies I want so nice tho mmm🥰I love it ...you should try it tho❤️"
        },
        {
          "at": "2024-03-25T11:12:58",
          "review": "I bought the premium in 2020 and now they have removed me from premium. The support also isn't responding since last 3-4 days.. I dropped my email. Developers if you are honest do reply and let me know why my premium isn't working."
        },
        {
          "at": "2024-03-15T08:05:05",
          "review": "This is one big fail it shouldn't even be here I didn't even get to watch a movie This app is useless Anyone reading this don't waste your time and data downloading this"
        },
        {
          "at": "2024-03-05T22:53:20",
          "review": "Update: Developer didn't fix the problem, and wouldn't give me a refund. Cancelled subscription. PLEASE STOP ADULT CONTENT FROM POPPING UP WHEN SEARCHING FOR MOVIES."
        },
        {
          "at": "2024-03-05T04:45:07",
          "review": "Changing my review from 5 to 1 star. Suddenly stopped working for me. Tried everything to make it work but nothing happened. It was my favourite app for trakt. Disappointed."
        },
        {
          "at": "2024-02-19T20:03:21",
          "review": "Lots of ads in the app. Better to try other alternatives. Most of the reviews here are by bots with standard wordings and totally unaware of the app.. lol. I was hoping they will reduce the ads after my last review 6 months ago. Better to uninstall and use Cinetrak or trakt apps."
        },
        {
          "at": "2024-02-18T20:08:39",
          "review": "The app seems not functioning from past 3 days...it says \"we dont receive valid data\" please retry. Dev. Please look out"
        },
        {
          "at": "2024-02-01T02:23:01",
          "review": "It was a very neat app before they deleted all the data I had collected with the new update! All my History and Watchlists are gone! And purchasing Premium has not helped!!!"
        },
        {
          "at": "2024-01-22T20:21:12",
          "review": "I don't know why but am in able to watch movie. Without me subscribing I can't watch movie in the app even with data?"
        },
        {
          "at": "2024-01-14T06:42:13",
          "review": "I really don't understand what's going on I wanna watch something and I can't I tap on the movie and I can't see anything"
        },
        {
          "at": "2024-01-08T11:04:30",
          "review": "Updated to the latest version, which then crashes repeatedly, and asks me to buy premium every single time I open it."
        },
        {
          "at": "2023-12-22T08:43:35",
          "review": "Installed. It immediately tried to sell me stuff. Then it didn't have the very first movie I was looking for. Google did. Uninstalled."
        },
        {
          "at": "2023-12-12T03:27:01",
          "review": "it's my first time using this hopefully there are lots of Martial arts Movies that I haven't seen yet"
        },
        {
          "at": "2023-11-22T02:48:22",
          "review": "What's the point of this app? You can't watch movies; you pick your favorite movies and that's it! Very confusing and a complete waste of an app."
        },
        {
          "at": "2023-10-30T01:30:19",
          "review": "Your app keeps closing out after I use the search feature, it seems like your search feature has been disabled."
        },
        {
          "at": "2023-10-01T02:04:53",
          "review": "first open it wanted me to subscribe. why ask to pay for something you have never used? In response to \"if you are unhappy with any of the features, you can contact us at\". I opened the app and was asked to pay. I don't know the features or any clue what I would be paying for. No thank you."
        },
        {
          "at": "2023-08-09T00:14:34",
          "review": "It used to be a great app until last update in July. After July's update, it shows an ad on every click which is extremely annoying. Going to uninstall the app until they fix it. One or two ads should be enough for each session, but an ad for every click is something nobody wants."
        },
        {
          "at": "2023-08-02T15:28:47",
          "review": "I'm finished with your ads &/or subscription prices. You losers that keep being that annoying are Uninstalled & given horrible reviews for wasting people's time without paying them. You're all greedy trolls I'm sick of seeing everywhere. #GoodRiddance"
        },
        {
          "at": "2023-07-23T06:09:34",
          "review": "No. Before this app would work for the first time it wanted access to my google play credit card account, without me ever having used it."
        },
        {
          "at": "2023-06-17T10:19:20",
          "review": "It shows ads only in foreign languages so you can't close them. Every time you click a show or movie"
        },
        {
          "at": "2023-06-16T22:32:16",
          "review": "Asked for my phone number to send pin via sms. I received sms but option for input pin disappeared foor good living me option only to ask again for pin. Every sms is about 3eur so I gave up"
        },
        {
          "at": "2023-05-19T02:06:25",
          "review": "Please don't there to download this app it is rubbish you can't even download videos with it, it only shows pictures only,it Such a Rubbish app"
        },
        {
          "at": "2023-05-18T09:47:32",
          "review": "Now that the official Trakt app is here, makes no sense to pay for an \"annual subscription\" for a third party app. I'd have bought the app if only they sold a lifetime sub instead of yearly, As good as the app maybe, it's just a cash grab."
        },
        {
          "at": "2023-04-03T22:12:01",
          "review": "Won't allow you to watch anything without you Subscribing first !!!!.... Just like ½ of the other movie apps. All they want from you is your...................... \"MONEY\"...\"MONEY\"...\"MONEY\" \"MONEY\"...\"MONEY\"...\"MONEYYYYYYYYYYYY\" !!! p.s. - How did they create those \"FAKE\" ratings ??? Google Play should investigate \"BEFORE\" allowing it in Playstore."
        },
        {
          "at": "2023-03-26T10:37:54",
          "review": "Long time user here, the ads have gotten out of control. Unstoppable 15 second ad everytime you click on a different movie? Useless."
        },
        {
          "at": "2023-03-19T12:21:28",
          "review": "This most scam you should never watch this piece of garbage i hate this packing up i should ever ever ever ever"
        },
        {
          "at": "2023-02-18T00:25:43",
          "review": "They asked immediately money through credit card details as so called \"free\" trial. Why not given areal probation time , maximum 10 days or 30 days, absolutely free, no money, no credit card details, and after this perriod, you can pay, if you are pleased by the quality and the diversity of the films/ movies?!!"
        },
        {
          "at": "2023-02-06T05:13:56",
          "review": "Suddenly I cannot access moviebase anymore as they tell me i need to update. Yet i have the most up-to-date version. That's a one star performance for me."
        },
        {
          "at": "2023-01-25T03:37:36",
          "review": "Not showing rankings from IMDB, Roten Tomatoes, etc. Too many screens to get where you need to go. Ads everywhere. Not an enjoyable experience."
        },
        {
          "at": "2023-01-14T04:36:11",
          "review": "Uninstalled - don't like apps that try to get you to click to open unknown material. Don't care what Livebeam is."
        },
        {
          "at": "2022-11-27T22:11:20",
          "review": "this app takes a long time to open and asks for to much data sharing. i dont mind an ad but not all my personal information to be put on third party sites ."
        },
        {
          "at": "2022-11-17T07:34:23",
          "review": "Every other update breaks one or more parts of the app, the most recent has made it completely unusable as it just shows a pop-up saying to update to the latest version, which it's on, and this pop-up prevents you from using the app at all, can't reinstall because the syncing issues have never been fixed so losing months of logging is the only guarantee from that"
        },
        {
          "at": "2022-10-28T19:00:08",
          "review": "When I started this app for the first time, it showed me immediately a pop-up asking for a rating. I haven't even been possible to test out this app. I find that a very intrusive and pushy!! That is for me already a reason to give one star!"
        },
        {
          "at": "2022-10-19T21:15:48",
          "review": "19th Oct'22 - Originally was an excellent experience 5 Stars! THEN updated to latest version and the intrusive ads have put me completely off from using what otherwise is a fantastic app. Feedback: Totally understand that you need to generate income from Ads and customers can opt for the Ad free paid version. What will help improve the free Ad Version is to follow other popular and successful apps which place a countdown in the top right hand corner with a button to skip ad once the timer ends."
        },
        {
          "at": "2022-08-30T06:29:55",
          "review": "UPDATE: App is not syncing/ loading since the last update!!! This app is amazing, it offers a variety of home customization and keeps track of your watch history."
        },
        {
          "at": "2022-08-16T21:02:55",
          "review": "It is a nice app really because I see both old and new movies and it's not all that expensive It gives a role hobby to your life It brings back the daily Entertainment"
        },
        {
          "at": "2022-07-19T18:11:28",
          "review": "Synchronisation error: Application is not storing the data of watched movies and webseries. When application gone slow and laggy I synchronised and reinstalled app. Now I've lost all data from past 2 months"
        }
      ],
      "2": [
        {
          "at": "2025-05-12T08:09:57",
          "review": "Love the app but when logging in after a fresh download, I can't get past the review screen. the button at the the of the onboarding \"let's explore\" is greyed out. I can't get into the app...."
        },
        {
          "at": "2025-03-11T19:21:10",
          "review": "Best Movie n TV data app.. Really appreciate the new features specially addition of popular review aggregaters...Edit(11/03/25) now the app is not working properly.. many bugs like home page not loading and a search bar not responding etc."
        },
        {
          "at": "2024-12-27T00:20:44",
          "review": "I'll stick with Letterboxed, Serialized & Just Watch. Pop-up ads and what should be basic features being locked are a strong no for me."
        },
        {
          "at": "2024-12-22T08:31:02",
          "review": "It is not clear if this app is for me alone to see I have sounds all aeou d commenting even ruddy views on my fingers moving make Wonly the frame works never ends"
        },
        {
          "at": "2024-10-18T07:41:35",
          "review": "Not at all easy to use, clunky. And then it lost all of my progress. Just when you think you know how to add a show, you don't get the updates for it. I give up."
        },
        {
          "at": "2024-05-04T13:09:50",
          "review": "UNINSTALL App works OK but the update since the last time I used it now has long ads you can't click thru or get out of. Had to watch a ridic long demo ad of a game I will never play then it auto opens in the playstore. Had to hit back 3x to get out of it. This is a stupid amount of effort just to mark a lame movie as watched just to give them my free user data which they'll probably then sell."
        },
        {
          "at": "2024-04-07T20:12:26",
          "review": "I recently installed this app and when I try to synchronise with Trakt, it takes forever. Please fix this issue."
        },
        {
          "at": "2024-03-27T18:40:28",
          "review": "What's happening with this app!! I would be happy to pay the premium but it keeps freezing on me. Doesn't change pages, I have to keep closing it refreshing it does it again. Shame used to be the best movie app ever!! Ruined it."
        },
        {
          "at": "2024-02-04T03:52:35",
          "review": "It used to be a great app, but there are way too many adverts now. Jumping between episodes in a season and I'm getting adverts every 3-4 screens. It's just ridiculous. I think I'll just go back to using Trakt."
        },
        {
          "at": "2023-11-21T13:51:04",
          "review": "You can rate movies/shows and track each episode and season watched, including specials. If you haven't watched yet, it'll say where you can watch. Just hit the app You want to watch on, and it'll take you to that app to watch. Tv time does all this too plus, no ads, and you don't have to pay for a premium membership to be able to comment on what you watch, and you can follow others who watch the same content, and tv time will show you how many total hours you've watched both movie and tv."
        },
        {
          "at": "2023-10-17T15:38:23",
          "review": "UI is a chaotic, disorganized carousel bonanza. If you want an app that's as annoying to scroll as Netflix, here ya go. Not serious competition for Letterboxd"
        },
        {
          "at": "2023-06-16T06:44:57",
          "review": "Needs home button always displayed so I don't have to close out the app or hit back 10x to go back to the home screen. Needs a way to remove a show from my lists if I don't want to watch it anymore or get updates. Otherwise, app is weak."
        },
        {
          "at": "2023-04-25T17:22:16",
          "review": "I like the idea of it, and my first use was fine. Ever since, however, any page I move to gets stuck on the loading screen. I could deal with the long, repetitive ads if I could actually use the app."
        },
        {
          "at": "2023-03-19T03:07:28",
          "review": "i can't synchronize anything with my trakt account (it looks like its can't connect to the service),pls fix the issue,I'll change my review after solving the problem using app on Android 7"
        },
        {
          "at": "2022-12-31T05:33:13",
          "review": "Can you integrate more sorting options for movies? Specially with category type. That's much needed feature. Edit: Last update created a memory leak so app is not usable after 3 mins and phone starts lagging"
        },
        {
          "at": "2022-08-29T06:10:47",
          "review": "No movies available for you to watch: They want you to download other apps for movies, they set up all this stuff and don't have no movies for you to watch or observe!"
        },
        {
          "at": "2022-07-22T22:10:33",
          "review": "The app is nice, but I found some bugs right after installing it. This was a bit disappointing, considering that the app really wants to convince me to buy the premium. For a premium app, I would expect better. Sadly I have to lower my score to 2 stars, as the synchronization from Trakt to Moviebase is not reliable..."
        }
      ],
      "3": [
        {
          "at": "2025-02-01T15:14:57",
          "review": "It was 5 but now 3 stars!!! Excellent app, superb, I love it!!! BUT lately you are showing so much fake scamming ads guys??? Where's the quality and security control??? It really is a shame ... Very disappointed in the last few months about the ads shown!!! Just to be clear: I am not complaining about the ads in general for the free version BUT for the ads leading to SCAM sites"
        },
        {
          "at": "2025-01-14T08:28:41",
          "review": "I wish I could give it 5 stars. But I needed to uninstall and reinstall and now it's showing that I've already purchased the Moviebase Unlimited premium on 10/24/24 through Google Play for $35.08"
        },
        {
          "at": "2024-12-31T11:00:31",
          "review": "I really like using this app but it's absurd to constantly be advertising the developer's other apps in the top half of the screen (in a paid subscriber). Please respect your customers."
        },
        {
          "at": "2024-11-10T02:08:57",
          "review": "Great app, but keep an eye out on the privacy permissions. 128 vendors want access to your data, with a dozen of toggles to disable."
        },
        {
          "at": "2024-10-10T16:33:18",
          "review": "Amazing app however it has someone issues specially when i try to to sign in to my account from another device. I removes some of the movies TV shows delete some of of the watched content remove some from my personal lists etc it is like it did not get all the data that is stored in my account into the new device"
        },
        {
          "at": "2024-07-09T15:30:44",
          "review": "Please I mistakenly subscribe in this app and I really need a refund please the money is not mine please help me..."
        },
        {
          "at": "2024-05-12T21:32:05",
          "review": "App good. But work on past bugs. Widget and app still does not refresh new upcoming content unless you manually sync by opening app and pull down to sync"
        },
        {
          "at": "2024-04-20T17:22:00",
          "review": "Decent app, but could be a lot better. Most of the home screen categories are terribly curated. I don't care what's going to be on DVD in 2031. Also, I just want to be able put my own notes on the movies I watch without having to write a review."
        },
        {
          "at": "2024-04-02T17:19:46",
          "review": "This app is very helpful and useful when it comes to movies , all kind of movies. I have used it for about 1 year"
        },
        {
          "at": "2024-02-25T03:18:43",
          "review": "It's such a good movie log app but there has been a bug for a while where the lists I have flash and then the screen goes black. I can still add to the lists but I can hardly see them and it's super annoying."
        },
        {
          "at": "2024-02-21T22:30:32",
          "review": "I used to love moviebase for its userinterface design but after this new update the app homescreen and it keeps on loading the icons. I have even tried to uninstall and reinstall but after installing and connecting to trackt it keeps on syncing and it doesn't end. At this point i cant use app in any manner. Fix this asap"
        },
        {
          "at": "2023-11-25T16:59:51",
          "review": "You have a good app here. Even subbed. Could use improvement though. 1. LET US..ADD A PICTURE & CHANGE EMAIL AND OUR USERNAME ON OUR PROFILE WITHOUT HAVING TO SIGN UP AGAIN WITH A NEW ACCOUNT 2. Let us..be able to RECOVER OUR ACCOUNT WITHOUT EMAIL in case we forget our sign up email 3. Let us..ADD THE MOVIE PRODUCTION COMPANIES that you have IN SEARCH to our PERSONAL LISTS and, 4. ADD MGM, A24 & BLUMHOUSE TO PRODUCTION COMPANIES. Once THESE things are addressed, FIVE stars all the way!"
        },
        {
          "at": "2023-05-19T07:08:50",
          "review": "Don't know how many stars to give this app because in one hand I really like this app on my Android and the features are super useful for me but in other hand I miss this app on my iOS devices like my iPad and Mac! I don't wanna use 2 or 3 different apps for the same purpose so It would be really appreciated if the developers bring iOS support or atleast a webapp would work too!"
        },
        {
          "at": "2023-03-05T16:11:36",
          "review": "Great app . But some movies relese year is wrong and we cant search by name with year. Please correct the release years of some movies"
        },
        {
          "at": "2023-01-30T10:00:53",
          "review": "One of the nicer Trakt apps available, but it needs some changes to really focus on the management of Trakt data. {-1-} There needs to be more immediate access to Collection, Personal Lists, and Watchlist. I'd suggest doing this by allowing for the removal / replacement of bottom-row tabs like Home, Search, and TV Shows. {-2-} Please add a prompt before removing something from Collection (keep the Undo prompt too, but please prompt before actually removing in the 1st place.)"
        },
        {
          "at": "2022-12-30T20:13:14",
          "review": "Everything works perfectly but in synchronization tab nothing works! I can't sync data with my trakt!! plsss tell me how to fix this issue ♡"
        },
        {
          "at": "2022-09-05T05:34:15",
          "review": "This app is getting very irritating. It keeps taking shows off of my watchlist without my knowledge. Why does it keep doing this!? It's very annoying, and this doesn't show movies and tv show recom from Amazon Prime video and Crave."
        },
        {
          "at": "2022-09-02T01:33:29",
          "review": "Good app but unstable due to ADs, works great when I block ADs using custom DNS but as soon as I disable custom DNS app starts freezing quite often, expecially when opening the app."
        },
        {
          "at": "2022-07-29T08:30:54",
          "review": "It's the best-looking Trakt companion app I've used on Android so far, but it would be so much better if the preferred rating source was shown in list view. I'd like to use this app to skim for movies I'll like, but I have to click on each movie to see the IMDB rating. The Trakt ratings simply don't have a large enough sample of voters."
        }
      ],
      "4": [
        {
          "at": "2024-11-10T12:14:25",
          "review": "App is working now. But there's some problem with syncing with trakt, if I update from trakt directly, it takes time for app to show up in it even though No delay is set in settings. Sometimes it doesn't even show it at all even later."
        },
        {
          "at": "2024-07-21T03:49:52",
          "review": "I've tried every movie tracking app, it could be the best but it needs two crucial options: 1. Don't show watched movies in recommendations 2. Giving more interesting insights"
        },
        {
          "at": "2024-05-20T03:11:27",
          "review": "I will see you and I will tell you because it is good or not good I don't know that's why and you can give me parmision I will see and I will tell anything is ther problem I will report tomorrow is partnership with photo this photo update the status of my number is not reachable by hi nahi hai taiyari shuru me athato matladathaava in Telugu h in logo ko i in Telugu i of the dragon Ball dragon movie in Telugu Telugu dubbed I want to you pranathi in Telugu movie in Telugu Telugu dubbed movies"
        },
        {
          "at": "2024-04-27T09:56:41",
          "review": "One of the best (if not the best) app for anything Movies/TV related. Only downside is that for the backup function you need to buy the premium version. But I think I will pay for this app. (Take my money)."
        },
        {
          "at": "2024-04-13T18:18:41",
          "review": "I've been using the app for a few days, I like it, useful and easy to understand, but please add more features like more content details especially a Parental Guid, and settings like importing personal library and watchlist from other platforms like IMDb. Keep working 💪 It will be great if you add a feature to export some movie or show as a well-organised screenshot or card (with the important infos) to save it or send it to someone 🙏"
        },
        {
          "at": "2024-03-19T23:10:39",
          "review": "great app and also reminder for all your favorite serie but can add something like up coming movie but guyzzz great jobs with the app"
        },
        {
          "at": "2024-01-06T08:41:28",
          "review": "Type @ in the comments below and select highlight to see who normally check your profile.If it turns blue then you got page watchers"
        },
        {
          "at": "2023-11-24T21:00:09",
          "review": "Good app, but it's recent versions (incl. 4.6.5) have an annoying issue. It is capable to create backups but is not able to restore it"
        },
        {
          "at": "2023-11-01T23:45:54",
          "review": "Being a user of Anilist (anime tracker), if this app could replicate its features, it would easily be a 5/5. Many things missing but its heading in a good direction. One of my favourite features is franchise grouping and seeing the connectied movies"
        },
        {
          "at": "2023-10-07T23:49:15",
          "review": "I really enjoy this application use it almost everyday. The only change I really would like to see if a setting to hide anime/cartoons as I find it's congested with it, unfortunately."
        },
        {
          "at": "2023-09-10T13:03:26",
          "review": "recently I reinstalled the app, to give it another chance... and I was surprised for good... after 20 months, this app has improved a lot... it has more functions that other apps - customizing homepage with various categories, easier tracking, more information about the titles, including the cast, and as always phenomelan UI... two things I would change - dont ask for the date when adding older shows, and add more regions... hopefully I will give 5 stars next time..."
        },
        {
          "at": "2023-09-01T03:04:05",
          "review": "New update looks better with the orange search removed. The TV section is sleaker, the minimalist selector for progress and upcoming looks good. The movie section however, I'm not a fan of the giant pill shaped selector at the top, much prefer the tv show design. Movie sorting works for history and watchlist, thanks for fixing that! Just noticed that there isn't a to watch section in TV, definitely needs to be added. Thanks for the updates and for making the best media tracker!"
        },
        {
          "at": "2023-07-25T15:03:25",
          "review": "I would like to be able to disable the season and episode section in watchlist and also be able to set IMDb rating in the list view as well , thank you"
        },
        {
          "at": "2023-07-21T20:37:36",
          "review": "Love it. Can we have more filters in the search tab? Also a \"hide watched\" option in search would be great"
        },
        {
          "at": "2023-03-03T01:12:27",
          "review": "Looks good so far. Do not understand why this app along with a few others don't have a section for Oscar or Golden Globe nominated movies."
        },
        {
          "at": "2023-01-15T23:02:21",
          "review": "It has been 2 years now using it and I initially voted 5/5 but recently I cant give it more than 4/5! It has very good features, continuesly updated one of them, but one feature that many other similar have and this doesn't is the show/use the Rotten tomatoes or/and Metacritic score/reviews. And that is in my opinion, a shortcoming when compared to other apps (especially Watcht, which I used before passing to Android). I hope in the future upgrades this will be fixed."
        },
        {
          "at": "2023-01-06T10:15:27",
          "review": "ALERT: I never give 5 stars in rating. This app is just the best. Their UI is state of the art. Their features are top of the class. And I am not even a premium user. P.S. Check out the Recommendation section in shows. The recommendation section in every show is.. is.. THE BEST. For every movie, every series, the recommendation I got, either matched what I previously watched or am watching now. And they aren't just similar to it. There's a similar section also, which houses shows similar to it."
        },
        {
          "at": "2022-12-31T16:46:04",
          "review": "I have been a premium user of this for more than a year. The app is great but some important features are missing.⁉️ 1️⃣. There should be an option to keep track of upcoming movies on my watchlist. 2️⃣. In the TV Shows progress section there should be an option to put shows on hold. (Currently, there is only an option to hide shows)"
        },
        {
          "at": "2022-12-05T23:48:28",
          "review": "Really nice UI layout, poster are clear and in good detail, options and settings are abudant, really pleased with application, would love to see the ability to customise some of the menus, such as being able to remove/hide things like seasons and episodes from the watchlist category etc...and also being able to view Trakt liked lists."
        },
        {
          "at": "2022-11-19T23:58:29",
          "review": "My goto Trakt.tv client on android! Absolutely perfect in every which way. The only thing I'd suggest the Developer is the suggestions while searching for an obscure movie -especially anything Asian related content is a hit/miss even though the entries are on TMDb. If that gets fixed, this is a near perfect app."
        },
        {
          "at": "2022-11-10T02:46:28",
          "review": "Beautiful app 👌Just facing one issue: I am getting notifications for new episodes only after opening the app. I am using the Premium version. I thought the app will notify me even without opening it?"
        },
        {
          "at": "2022-10-16T07:33:27",
          "review": "Nice, but I wish all my TV shows will appear on the upcoming, because if for example I havent watch a single episode of the show it wont add up to the upcoming. But once I watched an episode of the show it will show up on the upcoming."
        },
        {
          "at": "2022-08-01T00:34:24",
          "review": "Please add HBO Max as a provider and allow profile user rating sort at least in history for 5 stars."
        },
        {
          "at": "2022-07-15T00:05:40",
          "review": "Hi! Love the app. Simple and functional. However when trying to synchronise with Trakt I can only sync my watchlists and not my history. Could you please fix this?"
        }
      ],
      "5": [
        {
          "at": "2025-06-24T05:44:04",
          "review": "Thank You For Sharing Your Experience And Always Supporting Us Daily Watching Great Movies Every Day. Thank You For Showing Your Experience. Keep It Up 💯."
        },
        {
          "at": "2025-06-14T14:28:54",
          "review": "thanks for introducing this app to me. though dis is d first time of using it, know that you will not be boring when using it. thanks Welcome to Gboard clipboard, any text you copy will be saved here."
        },
        {
          "at": "2025-05-20T17:56:37",
          "review": "love the app.... krueger you are awesome. thanks for reverting the watchlist limit, if you are out of money do one thing add buy me a coffee button I would be the first to be helper for the server cost but don't limit the list count"
        },
        {
          "at": "2025-04-29T02:10:54",
          "review": "I would like to give 5 stars to this amazing and interesting app, I truly recommended this app to everyone!"
        },
        {
          "at": "2025-04-21T11:08:44",
          "review": "I've used Moviebase for years and I love it. Any issues that are bought up to the developer are worked on straight away, and you always feel listened to when raising concerns. I use premium, but the free version is fully usable and the premium isn't necessary if you aren't wanting to pay. I will continue using Moviebase as unlike other tracking apps, they don't put limits on lists or watchlists."
        },
        {
          "at": "2025-03-27T19:21:59",
          "review": "thanks for your wonderful app. have a question. how can I separate my account in moviebase from traktv? is there any way? because I usually login with my traktv account"
        },
        {
          "at": "2025-03-14T18:31:49",
          "review": "wow, it's such a Nice one... Great apps you can trust Anytime Anywhere, with reliable trust for Downloads, stress less with fast network wave, I advise you give this App a trial and share your testimony just like me... 👍👍"
        },
        {
          "at": "2025-03-12T03:59:05",
          "review": "Great app! I’d appreciate a feature that allows movies within a list to be arranged in a custom order, making it possible to create personalized ranking lists. Additionally, the ability to share these lists—potentially including my own ratings—with friends would be fantastic!"
        },
        {
          "at": "2025-03-11T18:06:49",
          "review": "I love this app, but I have decided to switch from Trakt to SIMKL after they limited the watchlist for normal users. It would be great if I could continue using this app with SIMKL."
        },
        {
          "at": "2025-02-20T12:10:43",
          "review": "Great UI design, resonable pricing. I'd like to move away from trakt, anyway to export data to moviebase or tmdb?"
        },
        {
          "at": "2025-02-10T13:49:52",
          "review": "I tried other movie trackers but they had way too many unnecessary features and confusing interfaces, then I found this one. I've been using it for more than two years! it's my absolute favorite! But now there's a limit on adding movies unless I get premium. I understand that the app needs revenue but this is too much. Movie tracking is the app's most basic function if it is limited then it's useless. Please reconsider. I have too much data here and no way to export I can't/don't want to switch."
        },
        {
          "at": "2025-01-11T00:17:16",
          "review": "I used to love this program but it's a few days that it's not possible to use it as before. It needs to have a primium account but when I want to buy, it shows nothing. I'm really sad about it."
        },
        {
          "at": "2024-12-30T22:50:15",
          "review": "I love this app it's so easy to use in my opinion and I can find everything I want to watch on there!"
        },
        {
          "at": "2024-12-19T17:42:00",
          "review": "Could you please add system default option in the widget theme? So we dont have to change all widgets manually after switching dark or light mode Thanks"
        },
        {
          "at": "2024-12-18T05:20:13",
          "review": "you are one of the best apps.you have a lot movies.i had you at number 3. for real you number 2.keep up the good work.am 62.year old man don't have cable.there nothing on tv."
        },
        {
          "at": "2024-12-05T21:32:22",
          "review": "A cada atualização fica melhor. A interface super limpa e minimalista é o que me faz amar esse app. 🤍"
        },
        {
          "at": "2024-12-02T21:48:44",
          "review": "Literally, this is the only application that I use to watch and browse to get news, new and old movies and series, but lately I can't even see the pictures of movies and series, please fix it"
        },
        {
          "at": "2024-11-11T16:21:19",
          "review": "The devs have decided to limit the number of movies that can be added in the free version! Unfortunately, I only found out after manually transferring them one by one from TV Time. It’s frustrating to find out after you’ve already added all your data and when there’s still no option to export it. At least add this limit clearly in the description. EDIT: the limit has been removed!"
        },
        {
          "at": "2024-11-05T22:11:03",
          "review": "It is incredible what they have done with the app. It was not enough with the constant ads than now there is a limit to how many films can you check as seen and out of sudden you can extended it if you pay. Lamentable, the developers are going to lose a lot of users with this greedy maneuver. Edit: Thank you for making this change, I really appreciate the gesture"
        },
        {
          "at": "2024-10-21T19:54:20",
          "review": "Why did you implement limit to add movies to watch list for the free version? You show so many freaking ads still set a limit. Wow. Edit: Thank you for your generosity. I do click ads to send some revenue over. Your forever price is high for me. I do understand the server costs being high. I do hope we can find some middle ground to have a win win situation. Once again Thank you."
        },
        {
          "at": "2024-10-21T19:01:08",
          "review": "They limited amount of movies you can add to watchlist and history, lame, greedy, do not bother 😒 Edit. Limitation were not reverted as I still can't add movies to history or watchlist Edit 2. I received premium access. I was finally able to add movies to history and watchlist. I thank the developer for this even though it's undeserved as I didn't/couldn't pay for it I will totally say this app is THE BEST for movies and TV shows tracking so please use it!"
        },
        {
          "at": "2024-10-21T03:42:51",
          "review": "A really good app for tracking TV shows and movies. I particularly like being able to get notifications about when new episodes come out and a calendar widget to see when new shows come out (wish the widget followed material theming but otherwise)"
        },
        {
          "at": "2024-08-19T15:52:28",
          "review": "I have been using this app for some time. Very useful for me. I would like to have a language filter. Think about that team."
        },
        {
          "at": "2024-07-20T16:41:50",
          "review": "know you can do this one 1⃣ my first day off and the way but your self is very much a little different from the way"
        },
        {
          "at": "2024-06-20T17:19:04",
          "review": "fantastic app. minimal. organised. however, one minor issue/inconvenience i've noticed, is the trailers section. most of the times it shows clips, sometimes spoilers of the movie/show, when all i want to see is the official trailer. please fix this by either pushing the trailers first or adding another section for clips, interviews... etc."
        },
        {
          "at": "2024-06-02T23:24:41",
          "review": "Personally I think it's a good app because for me there is no adds and it has every movie I want to watch."
        },
        {
          "at": "2024-04-19T06:26:34",
          "review": "it is like your video will resume after to the to you too dear sister please find attached the following the following up on this number or no hi to hai hi nahi"
        },
        {
          "at": "2024-02-10T19:37:13",
          "review": "You could be inspired by letterbox. We can follow our friends, see their activities, create our bio, share ours lists and share on stories from instagram. But this is just suggestions. This is the most complete app i ever seen. Guys, you are great, deserve more than 5 stars <3"
        },
        {
          "at": "2024-01-22T05:10:34",
          "review": "really love this app, have been using it for about a year now. it is my absolute favourite. has any movie or series you can think about. i understand it always develops but adding an ability to create a friend list, to see what movies someone watched, their ratings and reviews in this app would be really nice. anyways, thank you a lot for your hard work😊"
        },
        {
          "at": "2023-10-31T19:27:25",
          "review": "Really love the new style. Looks cool on amoled screen. Good job, mate. Still the best app for tracking movies and tv shows. Truly recommended."
        },
        {
          "at": "2023-10-31T12:59:24",
          "review": "Most definitely, the best movie and TV tracker available. I've tried them all, and nothing compares. The only question I have is that, is the Moviebase app in Microsoft Store made by the same people. It has the identical icon, although by only seeing 2 screenshots, it seems to lacking the UI and features. Could you please confirm as I would love to use this app on my PC. Thank you."
        },
        {
          "at": "2023-10-15T21:37:54",
          "review": "This is a good app for keeping tracked of what I've watched and when films and series are coming out"
        },
        {
          "at": "2023-09-30T15:21:53",
          "review": "Hi it's a great app, I give it 5 you can watch and download a movie, there is no lot of ad's keep it up."
        },
        {
          "at": "2023-09-19T00:10:45",
          "review": "Everything is perfect. I just want to suggest that you can add a button or something that can suggest random movies or series. And please add tomatometer reviews."
        },
        {
          "at": "2023-09-01T21:34:01",
          "review": "brings together my tv and movie history and progress. very simple. active developer. go premium!! read the description: this is NOT a streaming app!! you CANNOT watch tv shows or movies!! Don't downvote the app because of your own neglect."
        },
        {
          "at": "2023-08-31T09:50:21",
          "review": "This is a fantastic app, I don't know what I would do without it. They're just too many TV shows and movies to keep track of the old-fashioned way. The developer super responsive to any issues I have experienced, so I have zero complaints."
        },
        {
          "at": "2023-07-30T04:36:10",
          "review": "The best content data base App And it will be Great if you add some features like the ability to link other data base websites, and ability to create a variable list like a list for people or a list for people and content."
        },
        {
          "at": "2023-07-09T21:50:15",
          "review": "Having been a while on the app, I finally find it perfect, wish I could have a way to transfer my trakt content to the moviebase in case the former gets deleted for some reason in the future."
        },
        {
          "at": "2023-02-23T20:56:00",
          "review": "it's one of the best movie app it contains all the kinds of movies we u need it's better u got it now"
        },
        {
          "at": "2023-02-16T14:04:05",
          "review": "I have tried a lot of apps that use the Trakt API and this one is by far the best! I just bought my lifetime premium and it is totally worth it! I had one request though, we currently have the \"Upcoming Schedule\" category in the home, but it currently only works with shows. Would it be possible to get the same thing for movies as well? That would be great, thanks for creating this app!"
        },
        {
          "at": "2023-02-12T17:27:17",
          "review": "Great Application to Browse Movies. But One request , Can you add option to change grid size , I would love to see larger poster size by Such as 2 × 2 , Grid size of 2"
        },
        {
          "at": "2023-02-06T21:05:15",
          "review": "Muy buena aplicación, te permite organizar tus películas y series e incluso llevar un seguimiento de los episodios que llevas vistos, realmente me encantó esta app."
        },
        {
          "at": "2023-01-14T19:16:00",
          "review": "Love this app. I track all the movies, series and episodes we watch. We can see when new episodes are comming out and see at a glance how far in we were. Looks good and is easy to use - Great app!"
        },
        {
          "at": "2022-12-10T23:31:49",
          "review": "The app is an all-in-one super app for any and all thing related to Movies and TV series. UI is very good and highly customisable."
        },
        {
          "at": "2022-08-30T03:13:58",
          "review": "Great to be able to see programs available for services such as Netflix, with ratings and access to related program information right there."
        },
        {
          "at": "2022-08-18T10:21:49",
          "review": "easy to use.and helpful to wishlist movies and webseries also it properly notify the release dateof.all movies.and.webseries"
        },
        {
          "at": "2022-07-12T18:51:37",
          "review": "thanks for your time and happiness together for your number and I'll be there in about an hour and a"
        },
        {
          "at": "2022-07-09T01:20:31",
          "review": "I like no I taketh back ilove movie app a like like show time the movie Channel and tube and Pluto and movie. movie movie over all let's just say I am a movie freak thank you very munch"
        }
      ]
    }
  }
}